[
    {
        "title": "Is PayPal Holdings Inc. (PYPL) The Best Stock to Buy According to Billionaire Ray Dalio?",
        "link": "https://finance.yahoo.com/news/paypal-holdings-inc-pypl-best-164700587.html",
        "org": "Insider Monkey",
        "date": "2025-03-23T16:47:00.000Z",
        "body": "We recently published a list of 10 Best Stocks to Buy According to Billionaire Ray Dalio. In this article, we are going to take a look at where PayPal Holdings Inc. (NASDAQ:PYPL) stands against other best stocks to buy according to billionaire Ray Dalio.\nRay Dalio, with over 50 years of experience, is arguably one of the most influential investors on Wall Street. Having accurately predicted the 2008 financial crisis, he is often looked upon for insights and the direction the market will likely take in times of uncertainty. He is the brains behind Bridgewater Associates, a hedge fund he founded in 1973, which leverages various strategies, including Pure Alpha and macroeconomic analysis, to squeeze optimum returns in the markets.\nWhile Dalio gave up his CEO role at Bridgewater Associates in 2017, his sentiments still influenced the hedge fund’s investment strategy and play. Likewise, the hedge fund has remained on top of its game, generating an average return of 11.5% annually while leveraging the Pure Alpha Strategy.\nREAD ALSO: Paul Singer’s Latest Portfolio: Top 10 Stock Picks and 10 Best Stocks to Buy According to Seth Klarman.\nThe outperformance comes as the overall equity market has been in an uptrend amid the artificial intelligence-driven run. Likewise, the US economy staying clear of recession amid high interest has bolstered sentiments about market risk-taking.\nEven though the overall equity market has been in an uptrend, billionaire Ray Dalio is sounding the warning bells about an imminent debt crisis. The fact that the US debt-to-GDP ratio has risen to over 122% poses significant risks, according to the founder of Bridgewater Associates.\nOver the last two quarters, GDP has been gradually increasing, and unemployment and inflation have been relatively stable. However, Ray Dalio has warned that America’s national debt is a problem that is imminently coming and that it will rock the boat. According to Dalio, the US deficit must drop from a projected 7.2% of gross domestic product to about 3% of GDP.\n“We have a very severe supply and demand problem. Some people think we’ll handle it because we’ve handled it so far. I don’t think they understand the mechanics of debt.” Dalio said\nDalio’s caution comes as President Donald Trump’s administration struggles to retain significant tax cuts while simultaneously cutting the annual deficit, which most recently hit $1.8 trillion.\nAccording to Dalio, President Trump has undoubtedly shown that he is not afraid to use economic pressure to further his objectives. An examination of his executive orders since assuming office is sufficient proof that he has what it takes to reduce the US deficit and heightened debt levels.\nHowever, the Oval Office might have lost some of its goodwill with the countries that would have hurried to its aid by inflicting pain through trade tariffs. Uncertainty around trade policy has exacerbated investor anxiety on Wall Street as they worry about how a potential trade war will affect the world economy.\nTariffs against Canada, Mexico, and China are part of Trump’s trade policies, which are intended to rebalance the economy to America’s advantage. Nevertheless, they have the potential to trigger an economic slowdown and higher inflation.\nEven as Dalio remains concerned about the US debt levels and the uncertainty triggered by trade wars, he remains bullish about the US equity markets. Bridgewater Associates’ portfolio has significant exposure to tech stocks as it looks to benefit from the AI spectacle.\nTo make the list of the 10 Best stocks to buy, according to billionaire Ray Dalio, we selected the top 10 stocks in Bridgewater Associates’ portfolio as of its Q4 2024 13F filing. We settled on the hedge fund’s ten biggest holdings and examined why they stand out as Ray Dalio’s top stock picks. Finally, we ranked the stocks in ascending order based on the value of Bridgewater Associates equity stakes. Additionally, we have mentioned the hedge fund sentiment around each stock, as of Q4 2024.\nAt Insider Monkey, we are obsessed with the stocks that hedge funds pile into. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nA consumer in a cafe paying for goods using a mobile payment app.\nBridgewater Associates Equity Stakes: $201.29 Million\nNumber of Hedge Fund Holders: 94\nPayPal Holdings Inc. (NASDAQ:PYPL) is a financial services company that operates a technology platform that enables digital payments for merchants and consumers worldwide. While the company has struggled amid stiff competition from rival businesses, new management under new CEO Alex Chris has sought to reinvigorate its growth metrics.\nThe restructuring drive has also targeted the product line, resulting in several new features designed to streamline and speed up the buying process, such as Fastlane. It has also implemented operational changes, including integrating the all-important pricing feature. The changes are already bearing fruits, given that the total payment volume increased by 7% year-over-year in Q4 2024. In 2024, PayPal Holdings Inc. (NASDAQ:PYPL) made $31.8 billion in net sales, a 7% increase from the previous year. This led to $4.2 billion in net income, a 2% decrease.\nMonthly active users rose 2% to 223 million, while active accounts climbed 2% year over year to 434 million, affirming underlying growth. This is a change from numbers that had begun to fall, and it may be due to PayPal Holdings Inc.’s (NASDAQ:PYPL) new and enhanced features and products. A 5% year-over-year gain in Q4 earnings per share (EPS) reflects management’s efforts to improve efficiency.\nOverall, PYPL ranks 9th on our list of best stocks to buy according to billionaire Ray Dalio.While we acknowledge the potential of PYPL as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than PYPL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires\nDisclosure: None. This article is originally published at Insider Monkey."
    },
    {
        "title": "Paypal (PYPL) Ascends But Remains Behind Market: Some Facts to Note",
        "link": "https://finance.yahoo.com/news/paypal-pypl-ascends-remains-behind-214516960.html",
        "org": "Zacks",
        "date": "2025-03-24T21:45:16.000Z",
        "body": "The latest trading session saw Paypal (PYPL) ending at $70.97, denoting a +1.11% adjustment from its last day's close. The stock trailed the S&P 500, which registered a daily gain of 1.77%. Elsewhere, the Dow saw an upswing of 1.42%, while the tech-heavy Nasdaq appreciated by 2.28%.\nThe technology platform and digital payments company's stock has dropped by 6.35% in the past month, exceeding the Business Services sector's loss of 7.87% and lagging the S&P 500's loss of 5.73%.\nInvestors will be eagerly watching for the performance of Paypal in its upcoming earnings disclosure. The company's upcoming EPS is projected at $1.16, signifying a 17.14% drop compared to the same quarter of the previous year. Simultaneously, our latest consensus estimate expects the revenue to be $7.82 billion, showing a 1.57% escalation compared to the year-ago quarter.\nFor the entire fiscal year, the Zacks Consensus Estimates are projecting earnings of $5.02 per share and a revenue of $32.98 billion, representing changes of +7.96% and +3.72%, respectively, from the prior year.\nFurthermore, it would be beneficial for investors to monitor any recent shifts in analyst projections for Paypal. These latest adjustments often mirror the shifting dynamics of short-term business patterns. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the company's business health and profitability.\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.\nRanging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. The Zacks Consensus EPS estimate has moved 0.04% higher within the past month. Paypal presently features a Zacks Rank of #3 (Hold).\nDigging into valuation, Paypal currently has a Forward P/E ratio of 13.98. This valuation marks a discount compared to its industry's average Forward P/E of 15.25.\nIt's also important to note that PYPL currently trades at a PEG ratio of 1.19. The PEG ratio is akin to the commonly utilized P/E ratio, but this measure also incorporates the company's anticipated earnings growth rate. By the end of yesterday's trading, the Financial Transaction Services industry had an average PEG ratio of 1.41.\nThe Financial Transaction Services industry is part of the Business Services sector. This group has a Zacks Industry Rank of 133, putting it in the bottom 48% of all 250+ industries.\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nEnsure to harness Zacks.com to stay updated with all these stock-shifting metrics, among others, in the next trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nPayPal Holdings, Inc. (PYPL) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research"
    },
    {
        "title": "Guinness Global Innovators Sold PayPal Holdings (PYPL) as it Lost Confidence",
        "link": "https://finance.yahoo.com/news/guinness-global-innovators-sold-paypal-123929757.html",
        "org": "Insider Monkey",
        "date": "2025-03-24T12:39:29.000Z",
        "body": "Guinness Global Innovators, an investment management company, released its fourth-quarter 2024 investor letter. A copy of the letter can be downloaded here. The fund generated a total return of 21.9% (TR in GBP) in 2024, compared to the MSCI World Net TR Index return of 20.8%. 2024 turned out to be yet another successful year for stocks. For the first time since the 1990s, the S&P 500 has now produced two years in a row with returns of more than 20% (USD). Against a complex backdrop of shifting monetary policy, geopolitical instability, and disparate regional economic performance, global equities markets produced strong returns. To get an idea of the fund's best choices for 2024, check out its top 5 positions.\nIn its fourth quarter 2024 investor letter, Guinness Global Innovators emphasized stocks such as PayPal Holdings, Inc. (NASDAQ:PYPL). PayPal Holdings, Inc. (NASDAQ:PYPL) is a technology platform that enables digital payments. The one-month return PayPal Holdings, Inc. (NASDAQ:PYPL) was -6.72%, and its shares gained 6.35% of their value over the last 52 weeks. On March 21, 2025, PayPal Holdings, Inc. (NASDAQ:PYPL) stock closed at $70.19 per share with a market capitalization of $69.435 billion.\nGuinness Global Innovators stated the following regarding PayPal Holdings, Inc. (NASDAQ:PYPL) in its Q4 2024 investor letter:\n\"We initially acquired PayPal Holdings, Inc. (NASDAQ:PYPL) in July 2015 when eBay, a long-term holding of the Fund, spun it off as a separate entity. After a thorough evaluation of PayPal, we decided to sell our remaining position in eBay and reinvest it in PayPal. From July 2015 to October 2024, the stock delivered a total return of c.115% (in USD terms; vs MSCI World 150%). PayPal was a pioneer in digital payments and established itself as a convenient and secure alternative to traditional payment methods. As one of the first companies to offer a seamless online payment solution, PayPal quickly gained traction among both consumers and businesses, positioning itself as a dominant player in the digital payments space. For years, it enjoyed relatively limited competition, which helped the company secure a loyal user base and enjoy strong growth, exacerbated during Covid as the boom in ecommerce increased transaction volumes and sent the stock to all-time highs. In recent years, however, enthusiasm for the stock has diminished as post-pandemic volumes decreased more than expected and margins have contracted alongside. Additionally, investor concerns have mounted due to intensifying competition in its core PayPal Button business from emerging digital payment wallets like Apple Pay and CashApp, as well as slower growth in PayPal’s subsidiary products, Venmo and Braintree.\"\nA consumer in a cafe paying for goods using a mobile payment app.\nPayPal Holdings, Inc. (NASDAQ:PYPL) is not on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 94 hedge fund portfolios held PayPal Holdings, Inc. (NASDAQ:PYPL) at the end of the fourth quarter which was 90 in the previous quarter. While we acknowledge the potential of PayPal Holdings, Inc. (NASDAQ:PYPL) as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is as promising as NVIDIA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nIn another article, we discussed PayPal Holdings, Inc. (NASDAQ:PYPL) and shared the list of best stocks to buy, according to billionaire Ray Dalio. In addition, please check out our hedge fund investor letters Q4 2024 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: Michael Burry Is Selling These Stocks and A New Dawn Is Coming to US Stocks.\nDisclosure: None. This article is originally published at Insider Monkey."
    },
    {
        "title": "Is PayPal Holdings (PYPL) the Best High-Risk Stock to Buy According to Billionaires?",
        "link": "https://finance.yahoo.com/news/paypal-holdings-pypl-best-high-120639746.html",
        "org": "Insider Monkey",
        "date": "2025-04-07T12:06:39.000Z",
        "body": "We recently published a list of 10 Best High-Risk Stocks to Buy According to Billionaires. In this article, we are going to take a look at where PayPal Holdings, Inc. (NASDAQ:PYPL) stands against other best high-risk stocks to buy according to billionaires.\nInvestors often retreat into safer assets during volatility when the global markets move towards a chaotic storm. But for billionaire investors, market chaos could mean something else entirely: an opportunity. The new tariffs the current U.S. President announced on April 2, 2025, sent ripples across Wall Street. Multiple headlines have started forecasting a recession, and some of the wealthiest minds in the financial world are looking at high-risk stocks, not with fear but with an intent to utilize the opportunity. These minds work on the philosophy that market storms would wash away the timid but also drench the bargains for those willing to wade in.\nREAD ALSO: 10 Best Foreign Stocks to Buy According to Billionaires\nThe perspective is more relevant today as the stock market is seeing its highest drop in value since the COVID-19 pandemic. CNBC reported that only a handful of companies finished April 4 in the green, escaping the impact of the U.S. tariffs, but only slightly.\nExperts call the new commercial environment a full-blown trade war ignited by the U.S. President’s sweeping 10% tariffs on all U.S. trading partners. The countries targeted by the new tariffs have started retaliating by imposing additional tariffs on U.S. goods, thus worsening the situation. Notably, China, the largest trade partner of the U.S., retaliated by imposing a 34% tax on American goods and a crackdown on U.S. firms.\nAmid this panic, a small group of elite investors doubles down on risk. At first glance, it may seem like the strategy is built on unquestioning optimism, grounded in decades of historical precedent. Many billionaires believe that the best opportunities often surface during the ugliest moments in the market. Between 1980 and 2023, the average intra-year decline in the market was around 14%. Despite this staggering decline, the market could still post positive annual returns in 32 out of 44 years. Experts call the strategy positioning ahead of the rebound.\nIn this regard, high-risk stocks have often been seen outperforming once the dust settles. These stocks, exposed to uncertain market forces, are the type that collapse in weeks and double in days. Billionaires incorporate such high-risk stocks into their portfolios after estimating their time for recovery, innovation, and long-term asymmetry. It is not just about surviving the downturn but also about owning the comeback.\nGrowth stocks are garnering renewed attention in recent times in the category of high-risk stocks. Though they are bearing the effects of the current market carnage, historically, they have outperformed the value stocks in multi-decade comparisons. While these outperformances are not without any swings, they indicate that investors can move ahead with conviction and patience.\nOf course, choosing the right high-risk stocks requires a deeper understanding of market psychology and the macroeconomic undercurrents. In this regard, the billionaire portfolios offer a valuable window. Their public disclosures provide an insight into the stocks where capital is concentrated despite the crumbling sentiments.\nThese are not random gambles. They are signals that income-seeking investors could use to pepper their portfolio with a few high-risk stocks and benefit from the experts’ advocacy.\nFor this article, Insider Monkey’s billionaire database of Q4 2024 was reviewed to identify stocks with a beta value near 1.5, indicating they are expected to be about 50% more volatile than the broader market. Also, our list comprises stocks with positive earnings per share (EPS) over the past five years and a positive projected EPS growth over the next five years. The criterion was in place to consider only those stocks with historical profitability and future earnings potential. All the stocks have a consensus Strong Buy rating from Wall Street analysts, which suggests a positive market outlook.\nAdditionally, the stocks in the list are all large-cap firms, which reflects their market presence and liquidity. The stocks are ranked according to billionaire investors having stakes in them. We have sourced the required data from financial databases and analysts, with all information current as of April 4, 2025. Stocks’ presence in the number of hedge funds has also been considered to estimate the institutional interest.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nA consumer in a cafe paying for goods using a mobile payment app.\nNumber of Billionaire Investors: 17\nTotal Value of Billionaire Holdings: $1.73 Billion\nBeta: 1.51\nHeadquartered in California, U.S., a global fintech company, PayPal Holdings, Inc. (NASDAQ:PYPL) provides digital payment solutions to consumers and merchants across more than 200 markets. Core services offered by the company include online payments, peer-to-peer transfers, and merchant solutions. These services are provided under various sub-brands like PayPal, Venmo, and Braintree. The company differentiates itself from its competitors, like Apple Pay, through its continued innovation in digital wallets and checkout optimization, which has earned it a broad user base.\nPayPal Holdings, Inc. (NASDAQ:PYPL) is backed by 17 billionaires with $1.73 billion in holdings. In the last quarter, the company saw a 4% year-over-year increase in its net revenue, reaching $8.37 billion. The company has also recorded a 2% increase in year-over-year active users. Guidance for 2025 suggests a strong focus on becoming a commerce platform and expanding into B2B bill pay. The company is also planning to enable merchants to settle PayPal checkout transactions using cryptocurrencies before the end of 2025. Easier and more effective transaction features are expected to increase the active users’ percentage.\nPayPal Holdings, Inc. (NASDAQ:PYPL) is among the least volatile on our list, with a beta of 1.51. The company’s EPS increased by 14.03% in the last five years, though it is expected to slow down to 11.49% in the next five years. With 94 hedge funds remaining invested in Q4 2024, the faith of the institutional investors in the digital payments model remains high. PYPL is among the best high-risk stocks on our list.\nOverall, PYPL ranks 4th on our list of best high-risk stocks to buy according to billionaires. While we acknowledge the potential for PYPL as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than PYPL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey."
    },
    {
        "title": "PayPal Holdings (NasdaqGS:PYPL) Partners With TerraPay For Real-Time Transfers In Middle East Africa",
        "link": "https://finance.yahoo.com/news/paypal-holdings-nasdaqgs-pypl-partners-172855076.html",
        "org": "Simply Wall St.",
        "date": "2025-04-15T17:28:55.000Z",
        "body": "PayPal Holdings experienced a 6.39% price increase last week, coinciding with the announcement of a partnership with TerraPay to bolster real-time fund transfers in the Middle East and Africa. This aligns with a broader market trend where tech stocks led U.S. indices higher amid easing trade tensions with China. The collaboration with TerraPay targets financial inclusion and cross-border connectivity, which could enhance PayPal's growth prospects in a region with burgeoning demand for digital payments. PayPal’s performance mirrored the market's climb, indicating the partnership news supported the overall positive momentum seen in tech stocks.\nBuy, Hold or Sell PayPal Holdings? View our complete analysis and fair value estimate and you decide.\nDiversify your portfolio with solid dividend payers offering reliable income streams to weather potential market turbulence.\nThe recent partnership with TerraPay could enhance PayPal's growth prospects by expanding its reach in the Middle East and Africa, regions with rising demand for digital payments. This aligns with PayPal’s ongoing efforts to innovate its branded checkout and Venmo monetization, which are driving increased user engagement and revenue growth. These developments may positively impact revenue and earnings forecasts, despite anticipated challenges such as Braintree renegotiations and global economic uncertainties.\nOver the last year, PayPal's total return, including share price and dividends, was a 1.95% decline. This contrasts with the previous week's positive price movement of 6.39%, suggesting short-term gains driven by recent news announcements. However, the company's performance over the past year has underperformed the broader US market's 5.9% return, further highlighting the importance of ongoing innovations and partnerships for longer-term recovery.\nIn this context, PayPal’s current share price of US$57.41 remains significantly below the consensus analyst price target of US$89.25, reflecting a 43.34% discount. Analysts expect potential revenue to grow from US$31.80 billion today to US$37.6 billion by 2028, driven by increased adoption of PayPal's services and market expansion. It’s crucial for investors to consider how these projections align with their own valuation assumptions and future expectations for PayPal, as the projected growth depends heavily on successful implementation of these innovations and market conditions.\nExamine PayPal Holdings' past performance report to understand how it has performed in prior years.\n This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include NasdaqGS:PYPL.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com"
    },
    {
        "title": "Is PayPal Holdings Inc. (NASDAQ:PYPL) the Most Undervalued Quality Stock to Buy Now?",
        "link": "https://finance.yahoo.com/news/paypal-holdings-inc-nasdaq-pypl-135233749.html",
        "org": "Insider Monkey",
        "date": "2025-04-16T13:52:33.000Z",
        "body": "We recently published a list of the 11 Most Undervalued Quality Stocks to Buy Now. In this article, we are going to take a look at where PayPal Holdings Inc. (NASDAQ:PYPL) stands against other undervalued quality stocks to buy now.\nOn February 24, Kayne Anderson Rudnick chief market strategist Julie Biel joined ‘The Exchange’ on CNBC to discuss her thoughts on how good quality companies can ride out turbulence in the market. Just like Warren Buffett and Charlie Munger, Biel also suggests inaction as an investment principle and believes that holding high-quality companies can help investors deal with market volatility. She emphasized conviction in investing instead of impulsive decision-making. Biel also noted the general resilience of the US economy, which mainly comes from a robust jobs market as it fuels the consumer-driven economy. She also expressed unease over the limited tools available to address a potential recession that could come from high levels of deficit spending. She thinks inefficient businesses should be allowed to fail while protecting employees during economic cycles.\nBiel addressed small-cap stocks and explained that they struggle due to their higher leverage and sensitivity to prolonged higher interest rates. They often include significant exposure to real estate and banking sectors and have a high proportion of non-earning companies. She then emphasized that even if one were to invest in small caps, the ideal approach would be to look at high-quality small-cap companies that can yield strong results. Biel’s stock picks are quality companies that focus on tangible and physical solutions instead of those with foundations in hyped technologies like AI. While she acknowledged AI’s potential, she argued that it’s becoming standard and can no longer be categorized as a differentiator.\nWe sifted through the Vanguard U.S. Quality Factor ETF holdings to compile a list of the top stocks that had a forward P/E ratio under 15 as of April 14. We then selected the 11 undervalued stocks that were the most popular among elite hedge funds and that analysts were bullish on. The stocks are ranked in ascending order of the number of hedge funds that have stakes in them, as of Q4 2024.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nA consumer in a cafe paying for goods using a mobile payment app.\nForward P/E Ratio as of April 14: 12.52\nNumber of Hedge Fund Holders: 94\nPayPal Holdings Inc. (NASDAQ:PYPL) operates a tech platform that enables digital payments for merchants and consumers. It operates a two-sided network that connects merchants and consumers. It enables customers to connect, transact, and send and receive payments online and in person, as well as transfer and withdraw funds using various funding sources, such as bank accounts or Venmo.\nIn 2024, the company’s branded checkout segment saw consistent quarterly growth in transaction margin dollars. US growth in particular accelerated during the fourth quarter of this year. Upgraded checkout experiences, which are now live for more than 25% of US traffic, reduced latency by 40%, and boosted conversion rates by 1%. Fastlane, which is the company’s streamlined checkout feature, also reached ~2,000 merchants and attracted 75% new or re-engaged PayPal users.\nThe Buy Now, Pay Later (BNPL) segment of the company had $33 billion in total payment volume, which marked a 21% year-over-year increase in 2024. BNPL users spend 30% more on average as compared to the rest of PayPal Holdings Inc.’s (NASDAQ:PYPL) users. For 2025, the company plans to expand globally and deepen merchant partnerships, while growing its omnichannel presence.\nLongleaf Partners Fund stated the following regarding PayPal Holdings, Inc. (NASDAQ:PYPL) in its Q4 2024 investor letter:\n“PayPal Holdings, Inc. (NASDAQ:PYPL) – Digital payments platform PayPal was a contributor for the quarter and the year. The company delivered strong results, with gross margin dollars continuing to grow in the mid-high single digits for the last few quarters. Effective cost management further contributed to double-digit FCF growth, a key metric in our analysis. PayPal also demonstrated its commitment to enhancing shareholder value by repurchasing shares at a 10% annualized basis in the most recent quarter, leading to even stronger FCF per share growth. Much of what we envisioned at our initial investment has materialized quicker than anticipated. This strong performance has been driven by the improved leadership of relatively new CEO Alex Chriss.”\nOverall, PYPL ranks 2nd on our list of the most undervalued quality stocks to buy now. While we acknowledge the growth potential of PYPL, our conviction lies in the belief that AI stocks hold great promise for delivering high returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than PYPL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey."
    },
    {
        "title": "With 76% ownership, PayPal Holdings, Inc. (NASDAQ:PYPL) boasts of strong institutional backing",
        "link": "https://finance.yahoo.com/news/76-ownership-paypal-holdings-inc-110015486.html",
        "org": "Simply Wall St.",
        "date": "2025-04-19T11:00:15.000Z",
        "body": "Significantly high institutional ownership implies PayPal Holdings' stock price is sensitive to their trading actions\nA total of 25 investors have a majority stake in the company with 45% ownership\n Insiders have sold recently \nAI is about to change healthcare. These 20 stocks are working on everything from early diagnostics to drug discovery. The best part - they are all under $10bn in marketcap - there is still time to get in early.\nA look at the shareholders of PayPal Holdings, Inc. (NASDAQ:PYPL) can tell us which group is most powerful. The group holding the most number of shares in the company, around 76% to be precise, is institutions. That is, the group stands to benefit the most if the stock rises (or lose the most if there is a downturn).\nGiven the vast amount of money and research capacities at their disposal, institutional ownership tends to carry a lot of weight, especially with individual investors. Therefore, a good portion of institutional money invested in the company is usually a huge vote of confidence on its future.\nIn the chart below, we zoom in on the different ownership groups of PayPal Holdings.\n View our latest analysis for PayPal Holdings \nMany institutions measure their performance against an index that approximates the local market. So they usually pay more attention to companies that are included in major indices.\nAs you can see, institutional investors have a fair amount of stake in PayPal Holdings. This suggests some credibility amongst professional investors. But we can't rely on that fact alone since institutions make bad investments sometimes, just like everyone does. If multiple institutions change their view on a stock at the same time, you could see the share price drop fast. It's therefore worth looking at PayPal Holdings' earnings history below. Of course, the future is what really matters.\nSince institutional investors own more than half the issued stock, the board will likely have to pay attention to their preferences. We note that hedge funds don't have a meaningful investment in PayPal Holdings. Looking at our data, we can see that the largest shareholder is The Vanguard Group, Inc. with 8.7% of shares outstanding. With 7.5% and 4.4% of the shares outstanding respectively, BlackRock, Inc. and State Street Global Advisors, Inc. are the second and third largest shareholders.\nA deeper look at our ownership data shows that the top 25 shareholders collectively hold less than half of the register, suggesting a large group of small holders where no single shareholder has a majority.\nWhile studying institutional ownership for a company can add value to your research, it is also a good practice to research analyst recommendations to get a deeper understand of a stock's expected performance. There are a reasonable number of analysts covering the stock, so it might be useful to find out their aggregate view on the future.\nThe definition of an insider can differ slightly between different countries, but members of the board of directors always count. The company management answer to the board and the latter should represent the interests of shareholders. Notably, sometimes top-level managers are on the board themselves.\nMost consider insider ownership a positive because it can indicate the board is well aligned with other shareholders. However, on some occasions too much power is concentrated within this group.\nOur data suggests that insiders own under 1% of PayPal Holdings, Inc. in their own names. It is a very large company, so it would be surprising to see insiders own a large proportion of the company. Though their holding amounts to less than 1%, we can see that board members collectively own US$104m worth of shares (at current prices). It is always good to see at least some insider ownership, but it might be worth checking if those insiders have been selling. \nThe general public-- including retail investors -- own 24% stake in the company, and hence can't easily be ignored. While this size of ownership may not be enough to sway a policy decision in their favour, they can still make a collective impact on company policies.\nIt's always worth thinking about the different groups who own shares in a company. But to understand PayPal Holdings better, we need to consider many other factors.\nI like to dive deeper into how a company has performed in the past. You can access this interactive graph of past earnings, revenue and cash flow, for free.\nIf you would prefer discover what analysts are predicting in terms of future growth, do not miss this free report on analyst forecasts.\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned."
    },
    {
        "title": "Here's Why Paypal (PYPL) is a Strong Value Stock",
        "link": "https://finance.yahoo.com/news/heres-why-paypal-pypl-strong-134012887.html",
        "org": "Zacks",
        "date": "2025-03-28T13:40:12.000Z",
        "body": "For new and old investors, taking full advantage of the stock market and investing with confidence are common goals.\nWhile you may have an investing style you rely on, finding great stocks is made easier with the Zacks Style Scores. These are complementary indicators that rate stocks based on value, growth, and/or momentum characteristics.\nFinding good stocks at good prices, and discovering which companies are trading under their true value, are what value investors like to focus on. So, the Value Style Score takes into account ratios like P/E, PEG, Price/Sales, and Price/Cash Flow to highlight the most attractive and discounted stocks.\nPayPal has emerged as one of the largest online payment solutions providers on the back of its strong product portfolio and two-sided platform that enables it to offer smooth and secure transaction facility to both customers and merchants.\nPYPL is a Zacks Rank #3 (Hold) stock, with a Value Style Score of B and VGM Score of B. Shares are currently trading at a forward P/E of 13.7X for the current fiscal year compared to the Financial Transaction Services industry's P/E of 15.7X. Additionally, PYPL has a PEG Ratio of 1.2 and a Price/Cash Flow ratio of 12.3X. Value investors should also note PYPL's Price/Sales ratio of 2.1X.\nValue investors don't just pay attention to a company's valuation ratios; positive earnings play a crucial role, too. 12 analysts revised their earnings estimate upwards in the last 60 days for fiscal 2025. The Zacks Consensus Estimate has increased $0.11 to $5.02 per share. PYPL has an average earnings surprise of 14.3%.\nPYPL should be on investors' short lists because of its impressive earnings and valuation fundamentals, a good Zacks Rank, and strong Value and VGM Style Scores.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nPayPal Holdings, Inc. (PYPL) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research"
    },
    {
        "title": "PayPal Holdings, Inc. (PYPL): A Bull Case Theory",
        "link": "https://finance.yahoo.com/news/paypal-holdings-inc-pypl-bull-132145968.html",
        "org": "Insider Monkey",
        "date": "2025-04-10T13:21:45.000Z",
        "body": "We came across a bullish thesis on PayPal Holdings, Inc. (PYPL) on Substack by Hidden Market Gems. In this article, we will summarize the bulls’ thesis on PYPL. PayPal Holdings, Inc. (PYPL)'s share was trading at $63.95 as of April 9th. PYPL’s trailing and forward P/E were 16.03 and 12.79 respectively according to Yahoo Finance.\nPayPal (PYPL) has been massively de-rated over the past two years and now trades at a P/E below 14, despite remaining a key infrastructure layer for digital payments. In today’s uncertain environment—marked by sticky inflation, high rates, and growing geopolitical tensions—PayPal stands out as a resilient business with limited exposure to China and tariff-related risks. While markets are selling off across the board, quality companies like PayPal are getting dragged down with the rest, creating a mispricing opportunity. On top of that, the company is working on cost optimization and margin recovery, and there are ongoing spin-off rumors that could unlock further value. It’s priced like it’s 2015, but the business is much stronger today. In a market full of noise, PayPal is one of the few names that could not only survive but benefit from the current setup.\nPayPal Holdings, Inc. (PYPL) is not on our list of the 30 Most Popular Stocks Among Hedge Funds. As per our database, 94 hedge fund portfolios held PYPL at the end of the fourth quarter which was 90 in the previous quarter. While we acknowledge the risk and potential of PYPL as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than PYPL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: 8 Best Wide Moat Stocks to Buy Now and 30 Most Important AI Stocks According to BlackRock.\nDisclosure: None. This article was originally published at Insider Monkey."
    },
    {
        "title": "Is PayPal Holdings, Inc. (PYPL) Among the Best Digital Payments Stocks to Buy According to Analysts?",
        "link": "https://finance.yahoo.com/news/paypal-holdings-inc-pypl-among-121737385.html",
        "org": "Insider Monkey",
        "date": "2025-04-11T12:17:37.000Z",
        "body": "We recently published a list of 11 Best Digital Payments Stocks to Buy According to Analysts. In this article, we are going to take a look at where PayPal Holdings, Inc. (NASDAQ:PYPL) stands against other best digital payment stocks.\nDigital payment stocks are companies that specialize in designing, developing, or administering digital payment solutions. These firms use technology to enable electronic transactions between individuals, businesses, and institutions. Businesses that provide services such as online payment gateways, mobile payment apps, and peer-to-peer payment platforms can all be considered digital payment stocks. These technologies include digital wallets, payment processing systems, and blockchain-based payment solutions.\nThe global digital payment market is booming. According to Grand View Research’s report, the global digital payment market is anticipated to reach $96.07 billion in 2023, with a compound annual growth rate (CAGR) of 21.1% between 2024 and 2030. In terms of solution insights, payment processing led the market with 26.18% of worldwide revenue in 2023. North America dominated the market, accounting for 33.9% of total revenue in 2023. Europe is projected to see a substantial CAGR between 2024 and 2030.\nMeanwhile, according to Marqueta’s 2024 State of Payments Report, 46% of survey respondents in the USA reported using some type of contactless payment during the last seven days. This is in contrast with 80% in the United Kingdom and 69% in Australia. Emerging technologies such as cryptocurrencies and the metaverse aim to drive payment innovation and borderless payment choices for customers.\nAs per McKinskey‘s survey, in 2024, around 90% of consumers in both the US and Europe said they made at least one digital payment in the past year, with usage in the US hitting a record 92%. The survey defines digital payments as transactions completed online—through websites or apps—or in physical stores using dedicated apps like digital wallets. In-app and in-store payments contributed to this expansion, with digital wallet usage for in-store transactions rising from 19% in 2019 to 28% in 2024. This expansion reveals a $10 trillion annual market for both regions. Notably, 20% of digital wallet users in the country occasionally leave home without their traditional wallets, underlining the trend toward digital-first transactions.\nThere is also a difference in customer preferences between the US and Europe. European users prefer to choose local solutions like iDEAL in the Netherlands or Swish in Sweden, whereas US consumers prefer retailer apps. In America, younger consumers are especially attracted to “Buy Now, Pay Later” marketplaces, spending 1.5 to 2 times more than those who start on merchant websites. Rewards and offers are increasingly influencing payment decisions, with 25% of U.S. consumers citing rewards as a significant factor. This shows the increasing importance of digital wallets in everyday transactions. It opens up chances for payment providers to improve omnichannel loyalty programs and extend retail platforms. Furthermore, A2A payment formats may expand, particularly in the United States, where regulatory improvements could lower merchant costs.\nLooking forward, Deloitte’s 2025 payment industry insights outlook revealed that consumers are turning to digital payments, with check transactions dropping as large stores adopt a “check zero” strategy to reduce costs and fraud concerns. Global e-commerce sales are expected to reach $6.3 trillion by 2024, fueling the growing use of credit cards, debit cards, and peer-to-peer payments. P2P app usage has gone up by 12% since 2021, but cash and check P2P payments have dropped. Digital payments are becoming more popular in B2B due to cost savings and technological developments, but checks continue to play an important role.\nA consumer in a cafe paying for goods using a mobile payment app.\nFor this article, we first screened for companies that have operations in digital payments. Then, we identified stocks with positive analyst coverage and upside potential. Finally, from that group, we selected the 11 stocks that had the highest upside potential as of April 9, 2025. We have only included stocks in our list with an upside potential of 35% or higher. The stocks are ranked in ascending order of the upside potential.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nAnalysts’ Upside Potential as of April 9: 58.00%\nPayPal Holdings, Inc. (NASDAQ:PYPL) is one of the most prominent leaders in online payments, ranking fourth on our list of the Best Digital Money Stocks. Its name has revolutionized how consumers pay for products both online and offline, and its Venmo person-to-person payment network has become a market leader.\nThe company’s new leadership team is actively pushing growth by implementing efficiency improvements, Fastlane checkout, and a new advertising platform. PayPal Holdings, Inc. (NASDAQ:PYPL) has more than $11 billion in cash and assets on its balance sheet, as well as around $5 billion in annual free cash flow, giving it the financial flexibility to pursue opportunities as they occur. The firm currently has 432 million active accounts in over 200 countries worldwide. Its profitability and market-leading position suggest that the industry is likely to remain strong.\nStrategically, the company is prioritizing innovation to strengthen its position in payments and commerce. PayPal Holdings, Inc. (NASDAQ:PYPL) launched and expanded a number of unique services in 2024, including new branded checkout experiences, PayPal Everywhere, Fastlane, and PayPal Complete Payments. The business introduced PayPal Everywhere in September 2024. The invention allowed the firm to significantly increase debit card adoption and open up new areas of spending. The firm plans to expand PayPal Everywhere into European markets by 2025.\nOverall, PYPL ranks 4th among the 11 Best Digital Payments Stocks to Buy According to Analysts. While we acknowledge the potential of digital payment companies, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than PYPL but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.”\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey."
    },
    {
        "title": "Is PayPal Stock a Buy, Sell or Hold Post 17% Year-to-Date Dip?",
        "link": "https://finance.yahoo.com/news/paypal-stock-buy-sell-hold-172900429.html",
        "org": "Zacks",
        "date": "2025-03-26T17:29:00.000Z",
        "body": "PayPal PYPL shares have dropped 17% year to date, which can be attributed to intensifying competition in the fintech industry from the likes of Apple Pay and others. A challenging macroeconomic environment with growing risk of a recession attributed to U.S. President Donald Trump’s plan to levy tariffs on trade partners China, Canada and Mexico is expected to be an overhang on the stock.PayPal shares have declined 24.3% since hitting a 52-week high of $93.66 on Dec. 9, 2024. However, the stock is cheap, as suggested by the Value Score of B. PYPL stock is trading at a significant discount with a forward 12-month P/E of 13.7X compared with the Zacks Financial Transaction Services industry’s 23.56X.\n \nImage Source: Zacks Investment Research\n \nPayPal shares have appreciated 6.5% in the trailing 12-month period, underperforming the industry’s appreciation of 17.7%.\n \n \nImage Source: Zacks Investment Research\n \nPayPal shares are trading below the 50-day and 200-day moving averages, indicating a bearish trend.\n \nImage Source: Zacks Investment Research\n \nSo, is PayPal stock a buy, sell or hold at the current price level? Let’s analyze.\nPortfolio strength has been helping PayPal maintain deep and trusted relationships with merchants and consumers. Its two-sided platform helps develop direct financial relationships with customers and merchants. PYPL’s investments in improving branded checkout, person-to-person (P2P) and Venmo helped in driving total active accounts, which increased 2% year over year to 434 million in 2024. The number of payment transactions increased 5% year over year to 26.33 million. Expanding clientele benefited total payment volume (TPV), which increased 10% year over year to $1.68 trillion in 2024. Transaction margin in dollar terms increased 7% year over year while Buy-Now-Pay-Later TPV grew 21% year over year to $33 billion. Strong adoption of Fastlane is expected to boost future volumes as PYPL ink deals with NBCUniversal, Roku and StockX. PayPal expects transaction margin in dollar terms (ex-interest on customer balances) to grow at least 5% in 2025 and high-single-digit growth for 2027. Over the long term, this is expected to grow at more than 10%.Fastlane, which enhances the guest checkout experience by allowing users to complete their purchase in one click, is a noteworthy addition to the portfolio. PayPal’s partnership with Adyen, Global Payments and Pfizer is expected to attract more merchants to Fastlane. The solution is not only improving conversion for PayPal’s merchants but also making more shoppers familiar with PayPal. Roughly 75% of Fastlane consumers are new or dormant PayPal users, while 25% of Fastlane users never had a PayPal account.PayPal is expanding value-added services to boost the merchant experience. In the fourth quarter of 2024, PYPL launched FX-as-a-service, which is an automated currency conversion, and the platform is already live on Meta Platforms META. PYPL’s network tokens for automated billing capabilities are live with merchants, including Instacart, Mint Mobile and Poshmark. Expanding value-added services is expected to drive transaction margin in dollar terms.PayPal Everywhere, which was launched in September 2024, is driving significant increases in debit card adoption and opening new categories of spend. In the fourth quarter of 2024, PYPL added more than 1.5 million first-time PayPal debit card users and debit card TPV was up nearly 100%, with the most active reward categories being gas, groceries and restaurants. Venmo’s user base grew 4% year over year in the fourth quarter of 2024, reaching more than 64 million monthly active accounts.\nPayPal’s expanding partner base, including Fiserv, Adyen, Amazon AMZN, Global Payments and Shopify SHOP, is driving prospects. PayPal is now an additional processor for Shopify Payments in the United States. Its branded checkout solutions are now integrated into Shopify Payments. This creates a single and unified experience for business owners to drive operational efficiency. PayPal’s partnership with Amazon now brings PayPal Checkout to SMBs offering Buy with Prime. Its collaboration with Apple and Google to integrate the Venmo debit card with Apple Pay and Google Pay has been a noteworthy development. PayPal is a top payment method for advertisers and consumers globally across Meta Platforms’ family of apps. Creators and developers are using Hyperwallet. META also uses Braintree for credit card processing.\nPayPal reiterated 2025 non-GAAP earnings per share guidance growth range between 6-10% with higher low teens growth for 2027. Over the long term, PayPal is expected to grow at more than 20%. The Zacks Consensus Estimate for 2025 earnings is pegged at $5.02 per share unchanged over the past 30 days, suggesting 7.96% growth over 2024. PYPL’s earnings beat the Zacks Consensus Estimate in all the trailing four quarters, the average surprise being 14.26%.\nPayPal Holdings, Inc. price-consensus-chart | PayPal Holdings, Inc. Quote\n \nFind the latest EPS estimates and surprises on Zacks Earnings Calendar.\nPayPal’s robust portfolio, expanding partner base and cheap valuation are key drivers that make the stock attractive to long-term investors. However, intensifying competition is expected to hurt PayPal’s prospect in the near term. Continuing deceleration in unbranded volume is a concern.\nPayPal currently has a Zacks Rank #3 (Hold), which implies that investors should wait for a more favorable point to start accumulating the stock. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nPayPal Holdings, Inc. (PYPL) : Free Stock Analysis Report\nShopify Inc. (SHOP) : Free Stock Analysis Report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research"
    },
    {
        "title": "PayPal Holdings, Inc. (PYPL) Is a Trending Stock: Facts to Know Before Betting on It",
        "link": "https://finance.yahoo.com/news/paypal-holdings-inc-pypl-trending-130011101.html",
        "org": "Zacks",
        "date": "2025-04-09T13:00:11.000Z",
        "body": "Paypal (PYPL) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\nOver the past month, shares of this technology platform and digital payments company have returned -15.6%, compared to the Zacks S&P 500 composite's -13.5% change. During this period, the Zacks Financial Transaction Services industry, which Paypal falls in, has lost 12.2%. The key question now is: What could be the stock's future direction?\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nPaypal is expected to post earnings of $1.15 per share for the current quarter, representing a year-over-year change of -17.9%. Over the last 30 days, the Zacks Consensus Estimate has changed -0.5%.\nThe consensus earnings estimate of $5 for the current fiscal year indicates a year-over-year change of +7.5%. This estimate has changed -0.4% over the last 30 days.\nFor the next fiscal year, the consensus earnings estimate of $5.62 indicates a change of +12.4% from what Paypal is expected to report a year ago. Over the past month, the estimate has changed -0.5%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Paypal is rated Zacks Rank #3 (Hold).\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\nIn the case of Paypal, the consensus sales estimate of $7.82 billion for the current quarter points to a year-over-year change of +1.6%. The $32.97 billion and $35.16 billion estimates for the current and next fiscal years indicate changes of +3.7% and +6.6%, respectively.\nPaypal reported revenues of $8.37 billion in the last reported quarter, representing a year-over-year change of +4.2%. EPS of $1.19 for the same period compares with $1.48 a year ago.\nCompared to the Zacks Consensus Estimate of $8.23 billion, the reported revenues represent a surprise of +1.67%. The EPS surprise was +5.31%.\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates three times over this period.\nWithout considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nPaypal is graded B on this front, indicating that it is trading at a discount to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Paypal. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nPayPal Holdings, Inc. (PYPL) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research"
    },
    {
        "title": "PayPal Holdings (NasdaqGS:PYPL) Issues US$1.5 Billion Notes; Stock Down 9% Over Past Month",
        "link": "https://finance.yahoo.com/news/paypal-holdings-nasdaqgs-pypl-issues-174058660.html",
        "org": "Simply Wall St.",
        "date": "2025-04-04T17:40:58.000Z",
        "body": "In recent weeks, PayPal Holdings has been active with the integration of its services via Checkbook and key changes within its board. Joy Chik's addition as a director, alongside the issuance of $1.5 billion in senior notes, showcases the company's push towards innovation and financial structuring. Despite these advancements, PayPal experienced an 8.55% decline last month. Broader market turbulence, driven by escalating trade tensions and the subsequent market correction, likely overshadowed these positive company-specific developments, contributing to its share price downturn amid a tech-heavy Nasdaq Composite entering bear market territory.\nBuy, Hold or Sell PayPal Holdings? View our complete analysis and fair value estimate and you decide.\nThe end of cancer? These 21 emerging AI stocks are developing tech that will allow early idenification of life changing disesaes like cancer and Alzheimer's.\nOver the past year, PayPal's total shareholder returns showed a 4.38% decline, underperforming the US market and the US Diversified Financial industry. Earnings announcements during this period indicated a consistent rise in sales, reaching US$31.80 billion for the full year, but net income saw some pressure, decreasing to US$4.15 billion compared to the prior year. This divergence between sales growth and declining net income per share may have weighed on investor sentiment, contributing to the overall performance.\nSignificant corporate activities included an aggressive share repurchase strategy, with PayPal repurchasing 14.8 million shares in the last quarter, totaling 149 million shares since August 2022. Additionally, key leadership changes such as Joy Chik joining the board in March 2025 and debt issuances like the US$1.5 billion senior notes issue on March 6, 2025, aimed to solidify financial positioning amid volatile market conditions. Partnerships, such as with Norwegian Cruise Line, expanded PayPal's reach, adding another layer to its growth narrative despite the challenging year.\nDive into the specifics of PayPal Holdings here with our thorough balance sheet health report.\n This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include NasdaqGS:PYPL.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com"
    },
    {
        "title": "Here’s Why Wedgewood Partners is Holding PayPal Holdings (PYPL)",
        "link": "https://finance.yahoo.com/news/why-wedgewood-partners-holding-paypal-144930785.html",
        "org": "Insider Monkey",
        "date": "2025-04-17T14:49:30.000Z",
        "body": "Wedgewood Partners, an investment management company, released its first-quarter 2025 investor letter. A copy of the letter can be downloaded here. In the first quarter, Wedgewood Composite’s net return was -6.3% compared to the Standard & Poor’s -4.3%, the Russell 1000 Growth Index’s -10.0% and the Russell 1000 Value Index’s 2.1% return for the same period. In addition, you can check the fund’s best 5 holdings to know its best picks in 2025.\nIn its first-quarter 2025 investor letter, Wedgewood Partners highlighted stocks such as PayPal Holdings, Inc. (NASDAQ:PYPL). PayPal Holdings, Inc. (NASDAQ:PYPL) is a technology platform that enables digital payments. The one-month return of PayPal Holdings, Inc. (NASDAQ:PYPL) was -12.79%, and its shares lost 1.72% of their value over the last 52 weeks. On April 16, 2025, PayPal Holdings, Inc. (NASDAQ:PYPL) stock closed at $60.24 per share with a market capitalization of $60.057 billion.\nWedgewood Partners stated the following regarding PayPal Holdings, Inc. (NASDAQ:PYPL) in its Q1 2025 investor letter:\n\"PayPal Holdings, Inc. (NASDAQ:PYPL) was a leading detractor from performance for portfolios during the quarter. The Company's branded checkout grew by a healthy +6% while total payment volumes grew by +7% during the Company’s most recent quarter. PayPal also outlined several reinvestment initiatives across its platform that continue to accelerate its branded checkout volume growth back to double digits. In addition, the Company has authorized nearly $20 billion in share repurchases which represents nearly a third of its market cap as of quarter end. We continue to hold PayPal as one of our largest active weights in portfolios. \"\nA consumer in a cafe paying for goods using a mobile payment app.\nPayPal Holdings, Inc. (NASDAQ:PYPL) is not on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 94 hedge fund portfolios held PayPal Holdings, Inc. (NASDAQ:PYPL) at the end of the fourth quarter which was 90 in the previous quarter. While we acknowledge the potential of PayPal Holdings, Inc. (NASDAQ:PYPL) as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is as promising as NVIDIA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nWe covered PayPal Holdings, Inc. (NASDAQ:PYPL) in another article, where we shared the list of most undervalued quality stocks to buy. In addition, please check out our hedge fund investor letters Q1 2025 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: Michael Burry Is Selling These Stocks and A New Dawn Is Coming to US Stocks.\nDisclosure: None. This article is originally published at Insider Monkey."
    },
    {
        "title": "Paypal (PYPL) Advances While Market Declines: Some Information for Investors",
        "link": "https://finance.yahoo.com/news/paypal-pypl-advances-while-market-214516426.html",
        "org": "Zacks",
        "date": "2025-04-07T21:45:16.000Z",
        "body": "Paypal (PYPL) closed the latest trading day at $58.53, indicating a +0.27% change from the previous session's end. The stock outperformed the S&P 500, which registered a daily loss of 0.23%. Meanwhile, the Dow experienced a drop of 0.91%, and the technology-dominated Nasdaq saw an increase of 0.1%.\nComing into today, shares of the technology platform and digital payments company had lost 17.18% in the past month. In that same time, the Business Services sector lost 10.29%, while the S&P 500 lost 12.13%.\nThe investment community will be paying close attention to the earnings performance of Paypal in its upcoming release. In that report, analysts expect Paypal to post earnings of $1.15 per share. This would mark a year-over-year decline of 17.86%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $7.82 billion, up 1.57% from the year-ago period.\nRegarding the entire year, the Zacks Consensus Estimates forecast earnings of $5 per share and revenue of $32.98 billion, indicating changes of +7.53% and +3.72%, respectively, compared to the previous year.\nInvestors might also notice recent changes to analyst estimates for Paypal. These recent revisions tend to reflect the evolving nature of short-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\nOur research shows that these estimate changes are directly correlated with near-term stock prices. To take advantage of this, we've established the Zacks Rank, an exclusive model that considers these estimated changes and delivers an operational rating system.\nThe Zacks Rank system, running from #1 (Strong Buy) to #5 (Strong Sell), holds an admirable track record of superior performance, independently audited, with #1 stocks contributing an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has moved 0.38% lower. Paypal is holding a Zacks Rank of #3 (Hold) right now.\nInvestors should also note Paypal's current valuation metrics, including its Forward P/E ratio of 11.67. This represents a discount compared to its industry's average Forward P/E of 12.99.\nInvestors should also note that PYPL has a PEG ratio of 1.04 right now. Comparable to the widely accepted P/E ratio, the PEG ratio also accounts for the company's projected earnings growth. The Financial Transaction Services industry currently had an average PEG ratio of 1.28 as of yesterday's close.\nThe Financial Transaction Services industry is part of the Business Services sector. This industry currently has a Zacks Industry Rank of 86, which puts it in the top 35% of all 250+ industries.\nThe Zacks Industry Rank evaluates the power of our distinct industry groups by determining the average Zacks Rank of the individual stocks forming the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nKeep in mind to rely on Zacks.com to watch all these stock-impacting metrics, and more, in the succeeding trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nPayPal Holdings, Inc. (PYPL) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research"
    },
    {
        "title": "Paypal (PYPL) Dips More Than Broader Market: What You Should Know",
        "link": "https://finance.yahoo.com/news/paypal-pypl-dips-more-broader-214514276.html",
        "org": "Zacks",
        "date": "2025-04-15T21:45:14.000Z",
        "body": "Paypal (PYPL) ended the recent trading session at $62, demonstrating a -0.43% swing from the preceding day's closing price. This change lagged the S&P 500's 0.17% loss on the day. Elsewhere, the Dow lost 0.39%, while the tech-heavy Nasdaq lost 0.05%.\nHeading into today, shares of the technology platform and digital payments company had lost 10.6% over the past month, lagging the Business Services sector's loss of 3.14% and the S&P 500's loss of 3.94% in that time.\nInvestors will be eagerly watching for the performance of Paypal in its upcoming earnings disclosure. The company's earnings report is set to be unveiled on April 29, 2025. In that report, analysts expect Paypal to post earnings of $1.15 per share. This would mark a year-over-year decline of 17.86%. Meanwhile, our latest consensus estimate is calling for revenue of $7.82 billion, up 1.55% from the prior-year quarter.\nFor the full year, the Zacks Consensus Estimates are projecting earnings of $5 per share and revenue of $32.97 billion, which would represent changes of +7.53% and +3.7%, respectively, from the prior year.\nFurthermore, it would be beneficial for investors to monitor any recent shifts in analyst projections for Paypal. These latest adjustments often mirror the shifting dynamics of short-term business patterns. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.\nOur research demonstrates that these adjustments in estimates directly associate with imminent stock price performance. To utilize this, we have created the Zacks Rank, a proprietary model that integrates these estimate changes and provides a functional rating system.\nThe Zacks Rank system, stretching from #1 (Strong Buy) to #5 (Strong Sell), has a noteworthy track record of outperforming, validated by third-party audits, with stocks rated #1 producing an average annual return of +25% since the year 1988. Over the past month, the Zacks Consensus EPS estimate has shifted 0.41% downward. Paypal is currently a Zacks Rank #3 (Hold).\nIn terms of valuation, Paypal is currently trading at a Forward P/E ratio of 12.45. This represents a discount compared to its industry's average Forward P/E of 14.64.\nAlso, we should mention that PYPL has a PEG ratio of 1.11. The PEG ratio bears resemblance to the frequently used P/E ratio, but this parameter also includes the company's expected earnings growth trajectory. By the end of yesterday's trading, the Financial Transaction Services industry had an average PEG ratio of 1.31.\nThe Financial Transaction Services industry is part of the Business Services sector. This group has a Zacks Industry Rank of 85, putting it in the top 35% of all 250+ industries.\nThe Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nEnsure to harness Zacks.com to stay updated with all these stock-shifting metrics, among others, in the next trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nPayPal Holdings, Inc. (PYPL) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research"
    },
    {
        "title": "Seaport downgrades PayPal and Bill.com ahead of Q1 earnings on macro concerns",
        "link": "https://finance.yahoo.com/news/seaport-downgrades-paypal-bill-com-144659711.html",
        "org": "Investing.com",
        "date": "2025-04-17T14:46:59.000Z",
        "body": "Investing.com -- Seaport Research downgraded PayPal (NASDAQ:PYPL) Holdings and Bill.com warning that new macroeconomic pressures, particularly tariffs, could weigh on the fintech sector starting in the second half of 2025.\nThe brokerage cut PayPal to Sell from Neutral and Bill.com to Neutral from Buy, citing growing doubts about both companies’ ability to meet previously issued long-term growth targets.\nWe’ve lost confidence that either will eventually meet their previously stated guidance in this new paradigm, Seaport said.\nWhile first-quarter results are expected to be largely stable, Seaport trimmed its earnings estimates across the sector, pointing to slowing consumer and business spending. The firm now forecasts a median EPS cut of 0.4% for 2025 and 2.2% for 2026 across its coverage.\nFor PayPal, Seaport questioned whether the company can deliver 8%-10% growth in Checkout total payment volume by 2027, especially if discretionary spend and cross-border volumes weaken.\nIn the case of Bill.com, Seaport sees downside risk to the company’s forecast of 20% core revenue growth in FY26. The firm now expects 16% growth and flagged weakening sentiment among small- and mid-sized businesses.\nEven as valuations have pulled back, Seaport urged investors to remain selective. Analysts believe first quarter results could bring a short-term relief rally. “Q1 results should be fine, and there could even potentially be a NT snapback given shares have sold off noticeably over the few weeks on a better than feared quarter,” analyst said.\nAnalysts also believe there eventually will be an earnings revision cycle in the sector, with consensus estimates coming down, over these next few months, and “therefore we’d be pragmatic/selective buyers on names we remain Buy-rated on – we acknowledge a high likelihood that there’s significant volatility in the space NT.The brokerage is buy rated on Visa (NYSE:V), Fiserv (NYSE:FI), Shopify (NASDAQ:SHOP), Block, Shift4Pay and Dave.\nRelated articles\nSeaport downgrades PayPal and Bill.com ahead of Q1 earnings on macro concerns\nCiti downgrades residential solar Enphase, Sunrun on policy changes, tariffs\nBofA cuts TSMC stock target on increased tariffs-driven uncertainty"
    },
    {
        "title": "2 Stocks Down by 25% or More This Year to Buy and Hold",
        "link": "https://finance.yahoo.com/news/2-stocks-down-25-more-140000782.html",
        "org": "Motley Fool",
        "date": "2025-04-17T14:00:00.000Z",
        "body": "Equity markets have had a rough go of it this year due to President Trump's macroeconomic policies. Though it can be challenging to navigate this environment, one way to make the best of it is to look for terrific stocks to invest in while they are down. Doing so could lead to outsized returns for patient, long-term investors.\nTo that end, let's consider two stocks that have declined by at least 25% this year and look attractive: Viking Therapeutics (NASDAQ: VKTX) and PayPal (NASDAQ: PYPL).\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now. Continue »\nDrugmakers without a single therapy on the market tend to be somewhat risky, but investing in these companies early enough can lead to life-changing returns. Viking Therapeutics, a clinical-stage biotech, looks like one of the more attractive ones right now.\nThe company focuses on developing medicines for metabolic and endocrine disorders. It rose to fame last year thanks to excellent phase 2 data for its leading candidate, VK2735, a potential weight management therapy.\nIt's not just that VK2735's results were strong. The market for anti-obesity drugs is growing rapidly and is getting increasingly crowded. Drugmakers big and small are dipping their toes into this space -- very few have delivered mid-stage results that match those of VK2735.\nViking also produced strong phase 2 data for VK2809, a potential treatment for metabolic dysfunction-associated steatohepatitis. Another one of its candidates, VK0214, an investigational treatment for X-linked adrenoleukodystrophy -- a rare genetic nervous system disorder -- completed phase 1 studies recently, too.\nWhile many biotechs at this stage would focus on the candidates already being tested in humans, Viking Therapeutics is still looking for new gems. It is developing a next-gen weight loss medicine that mimics the action of two hormones: amylin and calcitonin. The former aids in controlling blood sugar and satiety, while the latter helps regulate calcium levels. Dual agonists are increasingly popular in this and other fields.\nViking's pre-clinical candidate may not pan out, but the company is constantly searching for the next big thing, an attractive quality in a biotech company. Although the stock has struggled recently, clinical and regulatory progress could lead to substantial gains in the coming years.\nThe biotech stock might be somewhat risky, but it is well worth initiating a small position in the stock today for those comfortable with some volatility.\nPayPal's shares fell this year because its fourth-quarter results failed to impress investors. The company's Braintree payment processing platform did not deliver growth on par with what Wall Street expected in its latest period, leading to the sell-off. The market turmoil only added fuel to the fire.\nDespite these issues, PayPal is a top fintech stock to buy and hold for a long time. Here are three reasons why.\nFirst, Braintree's disappointing performance in Q4 was due to PayPal's conscious decision to abandon unprofitable volume. That means lower sales (and sales growth), but higher profits and margins for the segment in the future. Short-term pain, long-term gains.\nSecond, PayPal has made important changes to its business in recent years that should pay off down the road. One of the most attractive opportunities it has conjured up, in my view, is its advertising business.\nPayPal is a trusted financial services brand. It ended 2024 with 434 million active accounts -- an increase of 2% year over year -- and millions of businesses that accept it as a payment option. Linking the two parts of the retail transactions it helps facilitate through an ad platform could represent a meaningful revenue source.\nThird, PayPal benefits from a strong moat even beyond its brand name. The company's platform displays the network effect. The more businesses within its ecosystem, the more attractive it becomes to consumers, and vice versa. That should allow PayPal to remain a leader in fintech for a long time, and given the industry's long-term prospects, the company could deliver strong results and stock market performances along the way.\nThat's why the stock is a buy today, while shares are down 26% this year.\nBefore you buy stock in Viking Therapeutics, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Viking Therapeutics wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $518,599!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $640,429!*\nNow, it’s worth noting Stock Advisor’s total average return is 794% — a market-crushing outperformance compared to 153% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks »\n*Stock Advisor returns as of April 14, 2025\nProsper Junior Bakiny has positions in PayPal and Viking Therapeutics. The Motley Fool has positions in and recommends PayPal. The Motley Fool recommends Viking Therapeutics and recommends the following options: long January 2027 $42.50 calls on PayPal and short June 2025 $77.50 calls on PayPal. The Motley Fool has a disclosure policy.\n2 Stocks Down by 25% or More This Year to Buy and Hold was originally published by The Motley Fool"
    },
    {
        "title": "Affirm vs. PayPal: Which Fintech Stock Should You Invest in Now?",
        "link": "https://finance.yahoo.com/news/affirm-vs-paypal-fintech-stock-134800195.html",
        "org": "Zacks",
        "date": "2025-04-17T13:48:00.000Z",
        "body": "Affirm Holdings, Inc. AFRM and PayPal Holdings, Inc. PYPL are two standout names in the fast-paced world of fintech, or financial technology. Both companies are playing key roles in reshaping how consumers make payments, offering innovative digital solutions across transactions, lending, and more. PayPal, a global heavyweight in online payments, continues to expand its ecosystem, while Affirm is quickly establishing itself as a leader in the rapidly growing buy now, pay later (BNPL) space, offering flexible installment plans designed for modern consumers.\nWith fintech stocks under pressure amid changing macroeconomic conditions, the big question for investors is: Which of these two fintech companies offers the better investment opportunity now? Let’s dive deep and closely compare the fundamentals of both stocks to determine which one is the smarter play at this moment.\nAffirm has emerged as a major player in the BNPL space, one of the fastest-growing segments in fintech. Its core offering enables consumers to pay over time with transparent terms and zero hidden fees, features that resonate particularly well with younger, tech-savvy customers. Affirm’s momentum is being driven by strategic integrations with major retailers such as StockX, REVOLVE and Shopify.\nWhat sets Affirm apart is its strong connection with millennials and Gen Z, demographics that increasingly favor flexible payment options over traditional credit. The company boasts a growing base of 21 million active consumers and 337,000 active merchants, a clear indication of its expanding ecosystem. Affirm's business model is also highly scalable. Beyond everyday purchases, it offers financing for big-ticket items like travel and home improvement, positioning itself for long-term growth across multiple verticals.\nBut Affirm isn’t stopping at BNPL. The company is steadily evolving into a broader financial services platform. It is developing debit products and exploring banking integrations to embed its services into consumers’ daily spending, whether for large purchases or routine expenses. This diversification strategy not only expands Affirm’s addressable market but also creates new revenue streams. The company achieved GAAP profitability in the last reported quarter and aims to maintain profitability starting in the fourth quarter of fiscal 2025.\nWhile the BNPL space remains competitive, with heavyweights like Klarna and PayPal in the mix, Affirm continues to innovate. In early April, it expanded its partnership with Shopify, launching Shop Pay Installments in Canada, with plans to enter the U.K. market next. Affirm is also eyeing international growth, with launches planned in Australia and Western Europe, where PayPal already has a wide presence.\nAFRM exited the fiscal second quarter with cash and cash equivalents of $1.2 billion, which increased 18.5% from the fiscal 2024-end figure. Funding debt amounted to $2.2 billion, which is understandable for such a growing company. AFRM generated $312 million of net cash from operations during the December quarter, significantly up from $74.3 million in the prior-year quarter.\nPayPal, on the other hand, is a well-established giant in the digital payment space. With 434 million active users at 2024-end, PayPal has a vast and loyal customer base, making it one of the most trusted names in online payments. Its ecosystem includes not only PayPal itself but also Venmo, a popular app for peer-to-peer payments, and a growing presence in cryptocurrency trading, making PayPal a strong contender in the broader fintech landscape.\nDespite its scale and market dominance, PayPal’s growth has slowed in recent years. It is facing significant pressure from competition from other digital payment platforms, like Square and even Affirm, which is intensifying. PayPal has been expanding into new markets and services, such as lending and cryptocurrency, and these segments have much room for growth. While PayPal relies on more traditional, less adaptive credit models, Affirm’s underwriting is more disciplined and data-driven, using real-time, transaction-level insights to assess risk.\nFurthermore, PayPal faces some challenges in terms of regulatory scrutiny and pricing pressures from larger merchants who may look for alternative payment processors to lower transaction costs. While PayPal’s business model is robust, its growth prospects are not as immediately exciting as Affirm’s, particularly as the latter taps into the booming BNPL market.\nPayPal’s cash and cash equivalents plunged nearly 28% in 2024 to $6.6 billion, while long-term debt rose more than 2% to $9.9 billion. Nevertheless, its 2024 cash flow rose to $7.5 billion from $4.8 billion a year ago.\nWhen it comes to analysts' expectations, Affirm holds an edge in terms of growth potential. The Zacks Consensus Estimate for AFRM’s fiscal 2025 sales and EPS implies a year-over-year improvement of 36.9% and 96.4%, respectively. The EPS estimates have been trending northward over the past month. (See the Zacks Earnings Calendar to stay ahead of market-making news.)\nImage Source: Zacks Investment Research\nIn contrast, PayPal’s growth is more modest, as analysts forecast slower earnings growth. The consensus estimate for PayPal’s 2025 sales and EPS implies a year-over-year rise of only 3.7% and 7.5%, respectively. The EPS estimates have been trending southward over the past month.\nImage Source: Zacks Investment Research\nOver the past year, Affirm stock has experienced significant swings, both up and down. PayPal, on the other hand, has been more stable, reflecting its mature business. However, AFRM shares gained 30.8% while PYPL witnessed a 3% decline. During this time, the S&P 500 Index grew 8.1%. The volatility seen in Affirm's stock could be seen as an opportunity for risk-tolerant investors looking to capitalize on its potential upside. PayPal, while relatively steady, may not offer the same growth opportunities in the short term.\nImage Source: Zacks Investment Research\nAffirm is currently trading at a higher price-to-sales (P/S) ratio compared to PayPal, reflecting the market’s optimism about its growth prospects. AFRM is trading at 3.43X P/S, higher than PYPL’s 1.77X. While both stocks have their merits, Affirm’s higher risk may be balanced by its higher potential reward, especially if it can continue to expand its partnerships and market share. PayPal’s valuation may offer a safer bet for more conservative investors, but it’s likely to have a lower ceiling for growth compared to Affirm.\nImage Source: Zacks Investment Research\nIn conclusion, while PayPal offers stability and a proven track record, Affirm has the edge in terms of growth potential, particularly due to its growing dominance in the rapidly expanding BNPL sector. Affirm’s ability to tap into a younger, tech-savvy demographic and form strategic partnerships with major retailers sets it apart as a more promising investment at the moment. It currently sports a Zacks Rank #1 (Strong Buy). Meanwhile, PayPal has a Zacks Rank #3 (Hold) now. You can see the complete list of today’s Zacks #1 Rank stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nPayPal Holdings, Inc. (PYPL) : Free Stock Analysis Report\nAffirm Holdings, Inc. (AFRM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research"
    },
    {
        "title": "Visa vs. PayPal: Which Global Payments Leader Has More Upside?",
        "link": "https://finance.yahoo.com/news/visa-vs-paypal-global-payments-154300735.html",
        "org": "Zacks",
        "date": "2025-04-10T15:43:00.000Z",
        "body": "In the rapidly evolving world of digital payments, two companies continue to lead the charge: Visa Inc. V and PayPal Holdings, Inc. PYPL. Both have played pivotal roles in transforming the global payments landscape, each carving out a dominant position in its niche. Visa is the backbone of card-based transactions worldwide, while PayPal has redefined peer-to-peer payments and remains a key innovator in e-commerce and mobile payment solutions.\nAs digital payment adoption accelerates across both developed and emerging markets, Visa and PayPal are capitalizing on the trend with ambitious international growth strategies. Yet their approaches, financial stability, and long-term prospects diverge in meaningful ways, making a head-to-head comparison especially timely. For investors seeking strong, long-term exposure to the digital payments space, the choice between these two fintech leaders is not always clear. Let’s dive in and closely examine their fundamentals to see which stock offers greater upside right now.\nVisa (market cap of $572.7 billion) remains the undisputed leader in global payments, processing over $13 trillion in payment volume in fiscal 2024. Its success stems from a powerful international network, exceptional brand equity, and deep ties with financial institutions worldwide. Unlike PayPal — which functions both as a digital wallet and a payments processor — Visa operates behind the scenes as the backbone of digital transactions, enabling secure, instant payments across borders.\nA key strength of Visa lies in its broad and diversified international footprint. Operating in over 200 countries, Visa reported in its first quarter of fiscal 2025 that more than 65% of its total transactions originated outside the United States. This geographic diversity not only spreads risk but also fuels growth, especially as the shift from cash to digital payments accelerates in emerging markets. Visa continues to deepen its presence in regions like Africa, Latin America, and Southeast Asia through strategic partnerships with local banks and fintech firms, embedding itself into the financial infrastructure of high-growth economies.\nFrom a financial standpoint, Visa delivers remarkable consistency and efficiency. It beat earnings estimates in each of the past four quarters with an average surprise of 3%.\nVisa Inc. price-eps-surprise | Visa Inc. Quote\nIt posted an impressive adjusted operating margin of 69.3% and generated $5.1 billion in free cash flow in the first quarter of fiscal 2025 alone. The company maintains a strong balance sheet, with a long-term debt-to-capital ratio of 30.3%, lower than PayPal’s 32.6%. Visa returned $16.7 billion to shareholders through share repurchases in fiscal 2024, followed by an additional $3.9 billion in buybacks and $1.2 billion in dividends in the first quarter of fiscal 2025.\nEven amid global macroeconomic uncertainty, Visa continues to deliver steady revenue and earnings growth, highlighting its resilience and scalability. Beyond maintaining its core business, the company is actively investing in innovation to stay ahead. Its moves into real-time payments, B2B services, crypto and blockchain-based solutions reflect a forward-looking strategy. Acquisitions such as Featurespace (AI payments protection) and Pismo (cloud native APIs) further strengthen Visa’s ability to lead in every facet of global payment infrastructure. In short, Visa combines scale, stability and growth — particularly in international markets — making it a formidable long-term investment.\nPayPal (market cap of $63.3 billion) has long been a digital payment trailblazer, particularly among consumers and small businesses. With over 434 million active accounts, it remains a central player in e-commerce and peer-to-peer payments through Venmo. However, its total payment transactions fell 3% year over year in the December quarter of 2024 to 6.6 billion, while Visa saw 11% growth to 63.8 billion transactions over the same period.\nDespite its solid U.S. presence, PayPal’s global reach lags behind Visa. Although it has made progress in Europe and parts of Asia, international growth has been constrained by regulatory challenges, local competition and relatively weaker brand recognition. Visa’s deep-rooted partnerships and widespread acceptance, both online and in-store, give it a clear edge globally.\nFinancially, PayPal’s metrics are solid but under pressure. Adjusted operating margin in the fourth quarter of 2024 has contracted 34 basis points to 18%, and its revenue growth has decelerated post-pandemic. Still, it beat earnings estimates in all the past four quarters with an average surprise of 14.3% and its free cash flow surged 58.7% in 2024, recovering from prior declines.\nPayPal Holdings, Inc. price-eps-surprise | PayPal Holdings, Inc. Quote\nWhile PayPal continues to innovate in areas like BNPL and digital wallets, its heavy dependence on the U.S. market (57% of fourth quarter 2024 net revenues) and lower international scale make it more vulnerable to domestic economic frictions. Its global potential is real but not yet fully realized.\nThe Zacks Consensus Estimate for Visa’s fiscal 2025 sales and EPS implies a year-over-year increase of 10.2% and 12.5%, respectively. The EPS estimates have been trending northward over the past month.\nImage Source: Zacks Investment Research\nMeanwhile, the consensus estimate for PayPal’s 2025 sales and EPS implies a year-over-year rise of only 3.7% and 7.5%, respectively. The EPS estimates have been trending southward over the past week.\nImage Source: Zacks Investment Research\nFrom a valuation standpoint, Visa may appear more expensive, but its premium is well-earned given its size, operational consistency and international growth opportunity. Visa is currently priced at 27.57X forward 12-month earnings, compared to PayPal’s 12.35X.\nImage Source: Zacks Investment Research\nOver the past month, shares of Visa have outperformed PayPal and the S&P 500 Index.\nImage Source: Zacks Investment Research\nBoth Visa and PayPal are iconic players in the digital payments space, but Visa holds a distinct edge in the race for global expansion. Its unmatched scale, high-margin business model and deeply rooted international presence make it a more reliable and diversified bet for investors. While PayPal remains a strong player in the digital wallet space, its growth is comparatively more localized and subject to greater volatility.\nFor investors seeking long-term exposure to the secular trend of global digital payments, Visa offers stronger fundamentals, broader global integration and more consistent financial performance. As such, Visa appears to have a better hand at the moment, even though both companies currently carry a Zacks Rank #3 (Hold) each.\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nVisa Inc. (V) : Free Stock Analysis Report\nPayPal Holdings, Inc. (PYPL) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research"
    },
    {
        "title": "Could Buying PayPal Stock Today Set You Up for Life?",
        "link": "https://finance.yahoo.com/news/could-buying-paypal-stock-today-191200942.html",
        "org": "Motley Fool",
        "date": "2025-04-13T19:12:00.000Z",
        "body": "Financial technology, or fintech, is about innovating and finding new ways to move money between people and businesses. PayPal (NASDAQ: PYPL) is the original fintech stock. It's been around since 2000, and it survived the infamous dot-com bubble. It's known today for its namesake digital and mobile payments network and Venmo, its peer-to-peer payments app.\nUnfortunately, PayPal isn't hot anymore. The business went stale, and the stock is down almost 80% from its high in 2021. PayPal's new CEO, Alex Chriss, hopes to teach an old company some new tricks that will revive the brand and stock.\nCan buying PayPal today set you up for life, or has this fintech stock seen its best days?\nThe answer may surprise you.\nIt's not flashy, but PayPal is still more prominent in the fintech space than you might guess. The company's payments ecosystem spans approximately 434 million active accounts across 200 markets, and it processed $1.68 trillion in payment volume last year. Establishing a global payments network is remarkably difficult in the face of competition and regulatory hurdles.\nDid PayPal's business grow stale? I'd say so. Competition in its payment processing business has steadily eroded its margins. The company's gross margins have slipped from approximately 64% a decade ago to under 46% early last year. Additionally, active accounts plateaued after 2021.\nThese are two nightmare developments! Yet, PayPal has continued to grow its top and bottom lines.\nNot many companies can stumble like this and grow earnings per share four-fold in 10 years. If the core business is this good, what will happen as Chriss executes his plan to build new products and features on top of it?\nAt its recent investor event, PayPal emphasized its goal of becoming a commerce platform. It hopes to leverage its payment technology and user data to drive engagement for its users and merchants. In other words, PayPal wants its platform to encourage people to buy, sell, pay, and borrow more, which is a win-win for all.\nThis will all take time, but the company has a high ceiling if it executes well. PayPal's network has already helped it compete in emerging vertical markets, like peer-to-peer payments, BNPL (Buy Now, Pay Later), and business loans and services. It launched a new digital advertising segment only months ago.\nPayPal guided for 6% to 10% earnings growth in 2025, with goals to achieve low-teens growth by 2027 and at least 20% annualized earnings growth after that. It's an aggressive goal, but again, PayPal's earnings roughly quadrupled over the past decade despite collapsing margins and little unity among the company's moving parts.\nThe best opportunities can make money without everything going as hoped, when there is far more reward than risk. I think that applies to PayPal here.\nMake no bones about it: PayPal has become a value stock. Shares are trading at their lowest valuations on record, including a price-to-earnings (P/E) ratio of just 16 and a free cash flow yield of over 10%. I'm not sure there is another stock at such a low valuation with a shot at 20% annualized long-term earnings growth.\nIn addition, PayPal announced a new $15 billion repurchase program in the fourth quarter. Combined with the remainder of its existing program, this brings PayPal's total upcoming repurchases to nearly $20 billion, roughly a third of its market cap. You could say management is putting its money where its mouth is and acting on the value it sees.\nThe massive repurchases will collapse the share count, boost per-share financials, and help establish a higher floor for the stock. Plus, PayPal can afford it. The company already has $10.8 billion in cash and expects $6 billion to $7 billion in cash flow this year. It's a financial buttress if PayPal doesn't organically achieve its growth goals.\nAs much as there is to like here, PayPal's market cap is almost $60 billion. That's probably too big for a small investment to grow into a fortune.\nHowever, PayPal could reward patient investors with years of market-beating investment returns if it lives up to its potential. Yes, it can move the needle and help lift a diversified portfolio. Buying high-quality, growing businesses at dirt cheap valuations is a winning strategy that can, over time, set you up for life. PayPal is a strong candidate to fit that mold.\nBefore you buy stock in PayPal, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and PayPal wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $495,226!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $679,900!*\nNow, it’s worth noting Stock Advisor’s total average return is 796% — a market-crushing outperformance compared to 155% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks »\n*Stock Advisor returns as of April 5, 2025\nJustin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends PayPal. The Motley Fool recommends the following options: long January 2027 $42.50 calls on PayPal and short June 2025 $77.50 calls on PayPal. The Motley Fool has a disclosure policy.\nCould Buying PayPal Stock Today Set You Up for Life? was originally published by The Motley Fool"
    },
    {
        "title": "PayPal Doubles Down on Checkout and Pay Later with New Will Ferrell Campaign and Biggest Sweepstakes Ever",
        "link": "https://finance.yahoo.com/news/paypal-doubles-down-checkout-pay-130000368.html",
        "org": "PR Newswire",
        "date": "2025-04-10T13:00:00.000Z",
        "body": "With $10M, and 1,000 winners per day, customers have another reason to use PayPal checkout every time they shop\nSAN JOSE, Calif., April 10, 2025 /PRNewswire/ -- PayPal (NASDAQ: PYPL) has been transforming checkout to make paying with PayPal fast, easy, and even more rewarding both online and in-store. Now, PayPal, one of the most ubiquitous leaders in checkout, is further enhancing the experience and giving customers broad choice and flexibility with added features for users to pay now or pay later.\nToday, PayPal teased that a new ad campaign featuring Will Ferrell will launch this month, highlighting the benefits of checking out with PayPal and PayPal Pay Later. Will's signature humor will be on display as he embarks on a shopping journey to show all the ways you can pay with PayPal now and over time, with Pay Later available at merchants that accept PayPal.\nThis comes on the heels of several updates that make it easier and faster to checkout with PayPal. Consumers can now move through checkout with less friction, thanks to the ability to login using biometrics and faster page load times showing over 40%1 reduction in latency. With PayPal being one of the top global Buy Now Pay Later options2, we're now also offering customers pre-qualified spending amounts when using Pay in 4 to help them decide how much to apply for. Plus, tap-to-pay with PayPal Debit Mastercard® 3 in mobile wallets lets customers earn cash back on up to $1,000 spent in their selected category each month4 – including on a new Rideshare and Public Transit category option.\n\"Payments are no longer an afterthought, they're a central driver in determining how consumers shop,\" said Geoff Seeley, Chief Marketing Officer at PayPal. \"With millions of consumers selecting PayPal every day, we're committed to raising the bar and delivering an incredible, flexible, and rewarding experience that connects our customers to the things they want and love.\"\nThe campaign also celebrates 'The Great PayPal Checkout' – the company's biggest sweepstakes ever.* PayPal is giving away up to $10M just for checking out with PayPal. Every day for 100 days, 1,000 lucky winners will have their purchases of up to $100 covered simply by paying with PayPal Checkout. Whether you're snagging the latest headphones, gearing up with new hiking boots, or stocking up on household essentials, PayPal is helping to cover 100,000 purchases this Spring and Summer.\n\"I love surprises. So naturally, I boarded a plane to shout about PayPal's sweepstakes from 30,000 feet. But don't look away, there's more to come next week – I might even sing again, who knows.\" said Will Ferrell.\nView Will shouting about the sweepstakes here.\nHow to enter \"The Great PayPal Checkout\" in just one step \nSelect PayPal Checkout online.\nCustomers can win up to five times so the more they select PayPal Checkout, the more chances for their cart to be covered. If selected as a winner, the cash value of their purchases will be transferred to their PayPal account.\nNot a PayPal customer yet? PayPal is a fast, secure, and rewarding way to shop and send money. With PayPal, customers have choice and flexibility at checkout so they can pay in the way that suits them including with their debit card, credit card, bank account, PayPal balance or by paying later with a PayPal Pay Later option.\nFor more information about The Great PayPal Checkout visit https://www.paypal.com/us/digital-wallet/thegreatpaypalcheckout\nBased on internal PayPal data as of Dec'24.\nPayPal's Pay in 4 is the 'Best Overall' Buy Now, Pay Later app. The Wall Street Journal (WSJ), Article - \"The Best Buy Now, Pay Later Apps.\" Buy Now, Pay Later apps were chosen based on availability, fees, clear terms, user-friendliness, and company reputation. Last updated October 17, 2024.\nThe PayPal Debit Card is issued by The Bancorp Bank, N.A. (The Bancorp), pursuant to a license by Mastercard International Incorporated and may be used everywhere Mastercard is accepted. Mastercard and the circles design are registered trademarks of Mastercard International Incorporated. The Bancorp is issuer of the Card only and not responsible for the associated accounts or other products, services, or offers from PayPal.\n5% cash back earned as points you can redeem for cash and other options on up to $1,000 category spend/month. Terms Apply.\n*NO PURCHASE NECESSARY. Legal residents of the 50 U.S. (D.C.) 18+, 19+ in AL & NE. Ends 7/18/25. See Official Rules for how to enter including how to enter without purchase. Participating merchants only.\nMedia Contact: Gideon Anstey; gbanstey@paypal.com\nView original content to download multimedia:https://www.prnewswire.com/news-releases/paypal-doubles-down-on-checkout-and-pay-later-with-new-will-ferrell-campaign-and-biggest-sweepstakes-ever-302425374.html\nSOURCE PayPal Holdings, Inc."
    },
    {
        "title": "Why Affirm's 38% YTD Drop Could Be a Golden Opportunity for Investors",
        "link": "https://finance.yahoo.com/news/why-affirms-38-ytd-drop-141600713.html",
        "org": "Zacks",
        "date": "2025-04-08T14:16:00.000Z",
        "body": "Shares of Affirm Holdings, Inc. AFRM have plunged 38.3% in the year-to-date period, underperforming the S&P 500’s 14.1% drop and the industry’s 7.1% slide. Even major digital payments service provider PayPal Holdings, Inc. PYPL lost 31.4% during this time. Established financial giants in credit and debit card solutions like Visa Inc. V and Mastercard Incorporated MA have only declined modestly, falling 1.2% and 7.8%, respectively.\nImage Source: Zacks Investment Research\nRecession fears, inflation concerns and worries about consumer debt repayment spooked investors across the fintech space. AFRM took an extra hit when Klarna struck a BNPL deal with a Walmart-backed finance app, raising doubts about Affirm's market share and future growth. As a result, AFRM now trades nearly 54.5% below its 52-week high of $82.53.\nBut this steep correction could be laying the groundwork for a comeback.\nAccording to a Wall Street Journal report, Klarna has paused its IPO plans amid the broader tech sell-off and tariff tensions. That is good news for Affirm. Without Klarna going public and raising fresh capital, AFRM faces less immediate competitive pressure in the BNPL space. And with Klarna out of the investor spotlight, more attention could shift toward publicly traded options like Affirm.\nAlso, Walmart’s switch is not as damaging as it seems. Per Affirm COO Michael Linford, Walmart accounts for only a small portion of its business. This helped the company to stay away from any “uneconomic” deal. Walmart represented just 5% of AFRM’s gross merchandise volume and 2% of adjusted operating income in the second half of last year.\nAffirm is expanding globally. After launching in Canada a few years ago, it entered the U.K. last November, aiming to use it as a launchpad for broader European expansion. Its BNPL major rival, PayPal, has a massive presence in Europe. With AFRM’s global partners already active in the region, this expansion could be smoother and faster.\nAffirm is also looking beyond BNPL. It is developing debit products and exploring banking integrations to make its services part of customers’ everyday spending, whether it is big-ticket items or daily purchases. This strategy will diversify its revenues and expand its addressable market size. This will also better equip the company to compete with major established entities like Visa and Mastercard. Affirm can build deeper relationships with consumers, personalize offerings and upsell new products.\nImportantly, AFRM is now focusing on sustainable growth rather than purely chasing expansion at any cost. It is tightening underwriting standards, optimizing operations and improving margins. This is essential for long-term investor confidence. It achieved the GAAP profitability mark in the last reported quarter and expects to sustain that feat from the fourth quarter of fiscal 2025.\nThe Zacks Consensus Estimate for fiscal 2025 earnings indicates a 94% year-over-year improvement, while the estimate for fiscal 2026 earnings implies a surge of 704.3%. Moreover, the consensus mark for fiscal 2025 and 2026 revenues suggests 36.9% and 24% year-over-year growth, respectively.\nSee the Zacks Earnings Calendar to stay ahead of market-making news.\nIt has delivered solid financial results lately, beating earnings estimates in each of the trailing four quarters, the average surprise being 84.1%.\nAffirm Holdings, Inc. price-eps-surprise | Affirm Holdings, Inc. Quote\nIn terms of valuation, the company is cheaply priced compared with the industry average. Currently, AFRM is trading at 3.17X forward 12-month sales, below its three-year median of 3.50X and the industry’s average of 5.97X. So, there is more room to grow.\nImage Source: Zacks Investment Research\nIn comparison, PayPal, Visa and Mastercard are trading at P/S of 1.73X, 13.92X and 13.57X, respectively.\nAffirm’s sharp decline may look discouraging on the surface, but it opens the door for a compelling entry point. With improving fundamentals, expanding international presence, product innovation beyond BNPL and a disciplined approach to profitability, the company is positioning itself for significant growth ahead.\nIts current valuation, combined with upbeat earnings expectations, makes it a strong candidate for investors seeking both value and future upside. Backed by a Zacks Rank #1 (Strong Buy), Affirm stands out as an attractive “buy-the-dip” opportunity in the fintech space at the moment. You can see the complete list of today’s Zacks #1 Rank stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMastercard Incorporated (MA) : Free Stock Analysis Report\nVisa Inc. (V) : Free Stock Analysis Report\nPayPal Holdings, Inc. (PYPL) : Free Stock Analysis Report\nAffirm Holdings, Inc. (AFRM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research"
    },
    {
        "title": "The S&P 500 Entered a Correction Last Week. 3 Stocks Down 20% or More to Buy on the Dip.",
        "link": "https://finance.yahoo.com/news/p-500-entered-correction-last-081500938.html",
        "org": "Motley Fool",
        "date": "2025-03-22T08:15:00.000Z",
        "body": "A stock market correction refers to a 10% to 20% pullback from a peak. The S&P 500 (SNPINDEX: ^GSPC) -- an index that includes roughly 500 of the country's biggest, profitable publicly traded businesses -- hit correction territory on March 13. It's the first time this has happened since 2022.\nDuring stock market volatility like corrections, shares of quality companies often go on sale, even if the market doesn't stay in the correction zone. This provides investors with better-than-normal chances to buy shares of quality companies at more attractive prices. And in my opinion, that includes PepsiCo (NASDAQ: PEP), Ulta Beauty (NASDAQ: ULTA), and PayPal (NASDAQ: PYPL) right now.\nFew businesses are as iconic as Pepsi. Not only is the company's beverage portfolio impressive -- a portfolio that now includes upstart prebiotic soda company Poppi thanks to a nearly $2 billion acquisition -- it also owns well-known snack brands, including chips from Frito-Lay. Given its scale and the breadth of its portfolio, the business is extremely stable and resilient, which means that Pepsi stock rarely goes on sale.\nHowever, Pepsi stock is on sale now, down about 25% from 2023 highs. Over the last 10 years, Pepsi traded at 26 times earnings, on average. At this writing, it trades for just 21 times earnings, a solid 19% discount to its usual valuation.\nPepsi stock is down because consumers seem to be cutting back on discretionary purchases. And they seem to finally be pushing back on Pepsi's price increases in recent years. But the company managed to eke out top-line growth in 2024, as well as bottom-line gains, nonetheless. And it will likely do so again in 2025. In short, things aren't as bad as they seem, and investors can still have confidence in Pepsi.\nAs the final icing on the cake, Pepsi's dividend yield is quickly approaching 4%. That's an all-time high, which is good for those who invest today. Keep in mind that this company has annually increased its dividend for 53 consecutive years, making it an elite Dividend King.\nWhile not as iconic as Pepsi, Ulta Beauty is still quite an establishment. There are more than 1,400 locations providing cosmetic products, and many offer salon services as well.\nAnd in the face of economic uncertainty, investors should remember that this is a recession-resistant space. Consider that Ulta Beauty's same-store sales increased in 2008, 2009, and 2010 -- years that were the heart of the Great Recession.\nUlta Beauty expects some same-store-sales growth in 2025, but guidance is so modest that investors aren't impressed. The stock is down nearly 40%. And it's not just because growth is slow. Another troubling truth is that its operating margin is slipping. It had a 15% margin in its fiscal 2023, but only expects an 11.8% margin in fiscal 2025.\nAt Ulta Beauty's size, this means that it expects to earn hundreds of millions of dollars less in operating income than it would otherwise earn if its margin was as good as 2023. That said, the company should still earn $1.3 billion in operating income in this coming year. Considering Ulta is only valued at $16 billion right now, this is a cheap stock.\nUlta Beauty's management regularly takes advantage of its cheap stock price. It buys back shares and has reduced the share count by 18% in the last five years. It expects to buy back $900 million more in 2025 -- well within its means -- which would reduce the share count by an additional 5%. Over the long term, this is great for shareholders who hold tight.\nFinally, PayPal stock last hit an all-time high way back in 2021. It finally outperformed the S&P 500 again in 2024 with a nearly 40% gain. But it followed this up with a disappointing nearly 20% slip to start 2025.\nHowever, it's important to note that much of its drop seems to be because financial technology (fintech) stocks are generally down right now. Just compare returns for PayPal with returns for the Global X FinTech ETF.\nI believe this strong correlation between PayPal and the Global X FinTech ETF suggests PayPal shares are down because investors have soured on the space. But I also believe that PayPal stock was up in 2024 for legitimately promising reasons.\nIn recent years, PayPal's transaction margin (a metric for fintech companies similar to gross margin) slipped. In short, the space is competitive, and the company lowered its prices to get business. But under new management, contracts are being renegotiated, and the transaction margin is improving again. That's what investors celebrated in 2024.\nThere's reason to keep celebrating. PayPal's management expects ongoing improvements through 2027. And this margin improvement should lead to earnings growth as well.\nPayPal stock trades at just 17 times earnings, close to the cheapest it's ever been. If the company manages to improve earnings over the next three years as it expects, I believe the stock will have plenty of upsides for investors who buy today.\nPepsi, Ulta Beauty, and PayPal are three big businesses that have historically proven to be quite resilient. The stock market is down, and these three stocks dropped as well. That's good news for investors looking to deploy some cash, and I believe any of these three could be good additions to a portfolio right now.\nBefore you buy stock in PepsiCo, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and PepsiCo wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $726,481!*\nNow, it’s worth noting Stock Advisor’s total average return is 835% — a market-crushing outperformance compared to 164% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks »\n*Stock Advisor returns as of March 18, 2025\nJon Quast has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends PayPal and Ulta Beauty. The Motley Fool recommends the following options: long January 2027 $42.50 calls on PayPal and short March 2025 $85 calls on PayPal. The Motley Fool has a disclosure policy.\nThe S&P 500 Entered a Correction Last Week. 3 Stocks Down 20% or More to Buy on the Dip. was originally published by The Motley Fool"
    },
    {
        "title": "Is This Bargain Stock Poised for a Bull Run?",
        "link": "https://finance.yahoo.com/news/bargain-stock-poised-bull-run-120000778.html",
        "org": "Motley Fool",
        "date": "2025-04-01T12:00:00.000Z",
        "body": "The S&P 500 might be trading 7% below the record high it touched in February, but investors are still concerned about high stock valuations. This makes perfect sense in the wake of the index's strong gains in 2023 and 2024. Across those two years, it rose by about 53%.\nBut all hope isn't lost for those still trying to find some reasonably valued equities to add to their portfolios. For those willing to look at beaten-down companies, there might still be lucrative opportunities to allocate capital with a long-term mindset.\nAs of March 25, one fintech stock was trading 77% off the peak it reached in July 2021, when COVID-19 was still a global health crisis. While the market's enthusiasm for this company has fallen, the fundamentals of the business could justify more optimism.\nIs this stock ready to go on a bull run?\nOn Feb. 4, PayPal (NASDAQ: PYPL) reported its fourth-quarter financial results. The figures didn't do much to excite investors, and propelled the stock downward this year.\nThe business generated $8.4 billion in revenue and $1.19 in adjusted earnings per share (EPS) in Q4, both of which exceeded Wall Street's consensus expectations. But the stock dipped 13% immediately following the release, perhaps due in part to the fact that total payment volume came in below expectations. \nIt's also worth noting that PayPal's growth in 2024 was slower than the year before. For the year, revenue was up 7% compared to the 8% growth posted in 2023. Consumer spending has continued its shift back to more normalized patterns, and away from the pandemic's intense focus on e-commerce. Consumer confidence has also been under pressure.\nHowever, PayPal remains extremely profitable. It produced $6.8 billion in free cash flow (FCF) in the last 12 months, and management is guiding for $6.5 billion (at the midpoint) this year. The company plans to use about $6 billion of that for share repurchases. \nPayPal's financial performance might not be as impressive as it was a few years ago. However, the company possesses one of the strongest brand names in the payments industry, and consumers and merchants trust it with their money. What's more, PayPal benefits from a robust network effect thanks to its two-sided ecosystem.\nThese competitive strengths provide a solid foundation for the leadership team to build upon. And management is certainly focused on charting a new strategic path for PayPal.\nOne of the company's objectives is to create a commerce platform that has a bigger presence both online and offline. Becoming a better partner for merchants by improving their ability to target customers is a priority, as is offering better services and a more personalized experience to consumers.\nManagement is excited about PayPal's prospects. They estimate the company's total addressable market for revenue to be over $1.1 trillion ($125 billion in online payments, $200 billion in offline payments, and $800 billion in ads, commerce, and credit). And they've set a long-term goal of putting up adjusted EPS growth of 20% annually. \nWhen a stock is trading down 77% from its all-time high, it's natural to be concerned about the outlook for the business. But in PayPal's case, the declines have left its valuation at a bargain level. PayPal shares now trade at a forward P/E ratio of 14.1. That's a 33% discount to the forward P/E of the S&P 500. \nInvestors might be worried that slower growth will be the new normal for PayPal, particularly given the competitive landscape in the fintech and payments arena. PayPal has a strong brand and it enjoys a healthy network effect, but it's up against some well-established players on both the consumer and merchant sides of the equation. It won't be a walk in the park for it to achieve top-line gains in the years ahead.\nHowever, PayPal deserves credit for the position it occupies in the payments industry. And management's strategic priorities, as well as its financial targets, should instill some confidence in investors.\nThe possibility of improving fundamentals, coupled with upside potential thanks to its discounted valuation, stacks the odds in favor of PayPal producing adequate returns over the next five years. While it's difficult to predict if the stock will go on a bull run in the near term, the setup for long-term buy-and-hold shareholders looks promising.\nEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $284,402!*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $41,312!*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $503,617!*\nRight now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.\nContinue »\n*Stock Advisor returns as of March 24, 2025\nNeil Patel and his clients have no position in any of the stocks mentioned. The Motley Fool has positions in and recommends PayPal. The Motley Fool recommends the following options: long January 2027 $42.50 calls on PayPal and short March 2025 $85 calls on PayPal. The Motley Fool has a disclosure policy.\nIs This Bargain Stock Poised for a Bull Run? was originally published by The Motley Fool"
    },
    {
        "title": "Got $5,000? These 3 Nasdaq Stocks Are Dirt Cheap Buys Right Now",
        "link": "https://finance.yahoo.com/news/got-5-000-3-nasdaq-090500706.html",
        "org": "Motley Fool",
        "date": "2025-04-03T09:05:00.000Z",
        "body": "As of Monday, the Nasdaq Composite index had tumbled more than 11% since the start of the year. The outlook for the economy is worrisome, as trade wars and promised tariffs could lead to disaster for many businesses. But that doesn't mean you should necessarily get out of the market. On the contrary -- this can be an optimal time to score some deals and investments you can hang on to for the long haul.\nIf you've got $5,000 you can afford to invest in the stock market today, three stocks you'll want to consider loading up on right now are Amgen (NASDAQ: AMGN), PayPal (NASDAQ: PYPL), and Baidu (NASDAQ: BIDU).\nHere's how cheap these three Nasdaq stocks are right now, and why they could be bargain buys.\nWhile the market has been struggling this year, shares of Amgen are up 17% so far in 2025. But even with its rally, this is still a fairly cheap healthcare stock to buy. It's trading at just under 15 times next year's estimated earnings (based on analyst estimates).\nThis is a good healthcare company to invest in: Not only does it have strong growth prospects, but it also pays a dividend that now yields 3.1%. Whether you want long-term gains from owning the stock or just recurring dividend income, it can be a suitable option for either goal.\nLast year, the company grew its top line by 19% to $33.4 billion. It has many blockbuster drugs in its portfolio, including Repatha (cholesterol) and Prolia (osteoporosis), which generated a combined $6.6 billion in sales in 2024.\nOn top of all this, Amgen has a highly promising injectable GLP-1 treatment for weight loss, MariTide, which would only need to be taken on a monthly basis (versus weekly, as is the case with other injectable treatments). It isn't approved yet but its results have been encouraging. And if it gets the green light, the stock could quickly take off.\nInvestors aren't all that excited with PayPal, because there's concern that with more payment options, demand for its platform will decline. However, the brand is strong, and it's still doing well despite consumers having an increased number of ways to send money and pay for goods. It's a go-to option that people are familiar with and trust, and that's why I see the payment processing company as an underrated investment.\nAlthough its growth rate hasn't been impressive of late (4% for the last three months of 2024), it comes at a time when consumers are scaling back on discretionary spending. The economy as a whole isn't doing terribly well, so it may not be surprising to see PayPal's results indicate similar challenges. The silver lining, however, is that its earnings were still fairly resilient in 2024 -- they totaled $4.1 billion and were down by just 2% year over year.\nThe fintech stock is trading at 13 times its estimated future earnings, and it can be a great place to invest $5,000 today. The stock is trading down more than 24% this year but in the long run, this is a stock that can recover as economic conditions improve.\nAt a forward price-to-earnings multiple of just 10, Baidu is the cheapest stock on this list. Its stock price is up 8% so far this year, as investors are beginning to warm up to Chinese tech stocks again. And when you consider that it's also investing heavily in artificial intelligence (AI), it's not hard to see why this is a stock which may have considerable upside in the future, and why it can be a great place to invest $5,000 into today.\nLast year, its AI chatbot Ernie Bot reached 200 million users. This year, Baidu will release an updated AI model which could attract even more users, as well as investors. In 2024, the company's sales declined by 1% to $18.2 billion, but with its AI cloud business picking up steam (growing at a rate of 24%), Baidu is optimistic that its investments into AI will pay off in the long run. Its robotaxi, Apollo Go, is a great example -- Baidu recently announced it will soon be deploying the vehicles in Dubai.\nThere is some risk and uncertainty which comes with Chinese stocks, due to the potential for government interference. But I still see Baidu as a great stock to buy, given its low valuation and attractive growth prospects for the future.\nEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $285,647!*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $42,315!*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $500,667!*\nRight now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.\nContinue »\n*Stock Advisor returns as of April 1, 2025\nDavid Jagielski has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amgen, Baidu, and PayPal. The Motley Fool recommends Nasdaq and recommends the following options: long January 2027 $42.50 calls on PayPal and short March 2025 $85 calls on PayPal. The Motley Fool has a disclosure policy.\nGot $5,000? These 3 Nasdaq Stocks Are Dirt Cheap Buys Right Now was originally published by The Motley Fool"
    },
    {
        "title": "Leverage Shares by Themes Launches Three New Single Stock Leveraged ETFs, Bringing Investors Exciting Opportunities to Amplify Exposure to Square (XYZ), Salesforce (CRM), and PayPal (PYPL)",
        "link": "https://finance.yahoo.com/news/leverage-shares-themes-launches-three-140000352.html",
        "org": "GlobeNewswire",
        "date": "2025-04-04T14:00:00.000Z",
        "body": "GREENWICH, Conn., April 04, 2025 (GLOBE NEWSWIRE) -- Leverage Shares by Themes, an issuer of innovative exchange-traded products, is thrilled to announce the launch of three new single stock leveraged ETFs, available for trading starting April 4, 2025. These products are designed to empower investors with the ability to amplify returns (up and down) and dynamically participate in the performance of leading companies. Each ETF is tailored to target a 200% leveraged exposure to the daily performance of its underlying stock, offering sophisticated traders and the retail investor an efficient tool to capitalize on market movements at an industry low management fee for single stock leveraged ETFs at .75%.\nThe new ETFs are:\nXYZG\nLeverage Shares 2X Long XYZ Daily ETF\nCRMG\nLeverage Shares 2X Long CRM Daily ETF\nPYPG\nLeverage Shares 2X Long PYPL Daily ETF\n“These ETFs mark another milestone in the Leverage Shares by Themes mission to revolutionize the way investors access the financial markets,” said Chief Revenue Officer of Themes ETFs Paul Marino. \"With these ETFs, traders can seize short-term opportunities with precision and flexibility, reinforcing our commitment to empowering the modern investor.\"\nAs part of the Leverage Shares by Themes offering, these funds focus on high-profile stocks in sectors that have the potential to shape the future of industries. XYZ (Square), CRM (Salesforce), and PYPL (PayPal) represent leaders in workflow management, technology and payment solutions that embody innovation, resilience, and growth. These ETFs enable investors to align their portfolio with forward-looking trends, while benefiting from the potential for enhanced returns (up and down).\nThis brings the total count of Leveraged Single Stock ETFs at Leverage Shares by Themes to 13. The entire lineup consists of the following:\nADBG\nLeverage Shares 2X Long ADBE Daily ETF  \nAMDG\nLeverage Shares 2X Long AMD Daily ETF\nARMG\nLeverage Shares 2X Long ARM Daily ETF\nASMG\nLeverage Shares 2X Long ASML Daily ETF\nCRMG\nLeverage Shares 2X Long CRM Daily ETF\nCOIG\nLeverage Shares 2X Long COIN Daily ETF\nHOOG\nLeverage Shares 2X Long HOOD Daily ETF\nNVDG\nLeverage Shares 2X Long NVDA Daily ETF\nPANG\nLeverage Shares 2X Long PANW Daily ETF\nPYPG\nLeverage Shares 2X Long PYPL Daily ETF\nNVDG\nLeverage Shares 2X Long NVDA Daily ETF\nTSMG\nLeverage Shares 2X Long TSM Daily ETF\nXYZG\nLeverage Shares 2X Long XYZ Daily ETF\nFor more information about these ETFs and other products offered by Leverage Shares by Themes, please visit www.leverageshares.com/us.\nFor media inquiries, please contact:\nArielle Shternfeld, Director, Communications and Advisor Relationsashternfeld@themesetfs.com+1 (860) 716-3686\nAbout Themes ETFs:\nThemes ETFs was established by the Co-Founders as a direct affiliate of Leverage Shares in 2023. Themes Management Company LLC serves as an adviser to the Themes ETFs Trust. Themes ETFs seeks to provide investors with targeted exposure to specific segments of the market via its low-cost ETFs. For more information, visit www.themesetfs.com.\nAbout Leverage Shares:\nLeverage Shares is the pioneer and largest issuer of single stock ETPs in Europe.1 The company was launched in 2017 by CEO Jose Gonzalez-Navarro, COO Dobromir Kamburov and General Counsel Tracy Grant (the “Co-Founders”) and has 160+ ETPs offering both leveraged and unleveraged exposure to single stocks, ETFs and commodities across various exchanges in Europe. Named Best ETP Provider in 2021 in the International Financial Awards. For more information, please visit www.leverageshares.com\n1Source: Leverage Shares, as of 9 October 2024, by AUM and trading volumes.\nInvestment involves significant risk. \nAMDG, ARMG, ASMG, COIG, NVDG, TSLG, and TSMG are designed to provide investors with amplified returns (up and down) on innovative companies in the technology sector. \nThe Funds are not suitable for all investors. The Funds are designed to be utilized only by knowledgeable investors who understand the potential consequences of seeking daily leveraged (2X) investment results, understand the risks associated with the use of leverage and are willing to monitor their portfolios frequently. The Funds are not intended to be used by, and is not appropriate for, investors who do not intend to actively monitor and manage their portfolios. For periods longer than a single day, the Funds will lose money if the Underlying Stock’s performance is flat, and it is possible that the Funds will lose money even if the Underlying Stock’s performance increases over a period longer than a single day. An investor could lose the full principal value of his/her investment within a single day.\nPERFORMANCE DISCLOSURE \nThe performance data quoted represents past performance. Past performance does not guarantee future results. The investment return and principal value of an investment will fluctuate. An investor's shares, when redeemed, may be worth more or less than their original cost; current performance may be lower or higher than the performance quoted. Returns for performance for one year and under are cumulative, not annualized. Short term performance, in particular, is not a good indication of the fund's future performance, and an investment should not be made based solely on returns. For additional information, see the fund(s) prospectus.\nINVESTMENT RISKS: Investing in the Funds involves a high degree of risk. As with any investment, there is a risk that you could lose all or a portion of your investment in the Funds.\nAn investor should carefully consider a Fund's investment objective, risks, charges, and expenses before investing. A Fund's prospectus and summary prospectus contain this and other information about Themes ETFs. To obtain a Fund's prospectus and summary prospectus call 886-584-3637. A Fund's prospectus and summary prospectus should be read carefully before investing.\nAn investment in the Fund involves risk, including the possible loss of principal. The Fund is non-diversified and includes risks associated with the Fund concentrating its investments in a particular industry, sector, or geographic region which can result in increased volatility. The use of derivatives such as futures contracts and swaps are subject to market risks that may cause their price to fluctuate over time. Risks of the Fund include effects of Compounding and Market Volatility Risk, Inverse Risk, Market Risk, Counterparty Risk, Rebalancing Risk, Intra-Day Investment Risk, Daily Index Correlation Risk, Other Investment Companies (including ETFs) Risk, and risks specific to the securities of the Underlying Stock and the sector in which it operates. These and other risks can be found in the prospectus.\nThemes Management Company LLC serves as an adviser to the Themes ETFs Trust. The funds are distributed by ALPS Distributors, Inc (1290 Broadway, Suite 1000, Denver, Colorado 80203). Themes ETFs are not sponsored, endorsed, issued, sold, or promoted by these entities, nor do these entities make any representations regarding the advisability of investing in the Themes ETFs. Neither ALPS Distributors, Inc, Themes Management Company LLC nor Themes ETFs are affiliated with these entities.\nTMC000618\n"
    },
    {
        "title": "How Elon Musk’s time at PayPal shaped his approach to overhauling Social Security",
        "link": "https://finance.yahoo.com/news/how-elon-musks-time-at-paypal-shaped-his-approach-to-overhauling-social-security-150048508.html",
        "org": "Yahoo Finance",
        "date": "2025-03-29T15:00:48.000Z",
        "body": "Elon Musk’s attempt to remake the Social Security system appears to be deeply informed by his time at a company that helped him become a leading figure in Silicon Valley: PayPal (PYPL).\nHis tenure at the digital payments upstart more than two decades ago was marked by a fight against fraud, which he and his then-colleagues considered an existential threat to their enterprise.\n\"Fraud wasn't just a storyline at early PayPal — it was the storyline,\" said Jimmy Soni, an author of a book about the company that turned into a tech star in the late 1990s and early 2000s. \"It represented survival or catastrophe.\"\nHow Musk and his PayPal cohort tried to deal with financial cheating in that era has clear echoes today as Musk's DOGE team has embarked on a search for fraud across the federal government and in the Social Security system in particular.\nWhile available data shows that fraud is a much smaller relative issue in the federal government now than at early PayPal — where losses indisputably represented a sizable piece of the startup's balance sheet — Musk rarely offers commentary these days that doesn't make charges of widespread wrongdoing around the government.\n\"This is happening all day, every day,\" he said just this past week during a Fox News appearance, adding, \"It's because of all the fraud loopholes in the Social Security system.\"\nIn that interview with Musk and his DOGE colleagues, fraud came up 28 times, according to a search of the transcript, with Musk adding his view that if the issue is not addressed \"we're going to go bankrupt.\"\nSimilarly, when Musk talked about his time at PayPal for Soni's 2022 history of the company, he recalled thinking that \"if the fraud thing is not solved, we're going to die.\"\nMusk's PayPal history began in 1999 when he co-founded a company called X.com that had a mission of becoming an online bank for an early internet adopter audience.\nX.com later merged with a competitor that called its payments application PayPal. Musk briefly led the combined entity but was pushed out shortly afterward, with the company eventually renaming itself PayPal.\nThe connections between PayPal and Social Security may be tenuous — both in their history and documented levels of fraud — but it's a connection many Trump allies have eagerly embraced.\nSocial Security began in 1935 and is a weekly part of life for millions of citizens; in 2025, the agency sent out about $1.6 trillion in benefits to around 69 million Americans.\nA hearing this week for Trump's pick to lead Social Security was notable for repeated descriptions of Social Security as — in the words of one senator — \"a payment system at its core.\"\nNominee Frank Bisignano called the agency he aims to lead \"fundamentally ... a payment-based customer-facing program\" in language that could also describe PayPal.\nThe PayPal connection is one that Commerce Secretary Howard Lutnick, a close Musk ally, has drawn most sharply.\nIn recent comments on the podcast \"All-In\", the Commerce secretary floated the idea of cutting off Social Security payments as a potentially good means to find fraud because he feels that most Americans, unlike fraudsters, \"wouldn't call and complain.\"\n\"All the guys who did PayPal, like Elon, knows this by heart,\" Lutnick added. \"Anybody who's been in the payment system and the process system knows the easiest way to find the fraudster is to stop payments and listen.\"\nSoni said that his work suggests a different lesson from PayPal's fights against fraud — more about the value of exploiting the evidence that fraudsters leave.\n\"PayPal's brilliance was in building sophisticated detection systems that could identify those suspicious patterns while minimizing disruption to legitimate users,\" Soni added, saying PayPal succeeded by \"finding that sweet-spot balance between fraud prevention and user friction.\"\nIndeed, PayPal's work to combat fraud was ahead of its time. The company pioneered things like challenge-response tests to tell computers and humans apart (known as CAPTCHAs) and other methods, like random deposit verification for bank accounts, still in use today.\nMusk has also used his time at PayPal as a bona fide for his current access to highly sensitive government data. In February, he posted that if he wanted to sift through personal data, \"I could have done that at PAYPAL. Hello???\"\nLutnick's idea of cutting off payments is not something that Musk himself appears to have embraced, and he has also talked about applying technical solutions to many of the government's fraud problems.\nMusk — who likes to brand his DOGE effort as \"tech support\" — often says technical solutions like closing fraud loopholes and creating better-connected computer systems will take care of many problems.\nBut Musk has also often repeated claims of widespread stealing at the agency, charges President Trump also regularly echoes.\nMusk has said Social Security may represent \"the biggest fraud in history\" and added in a Fox Business appearance that waste and fraud in entitlement spending is \"the big one to eliminate.\"\nBy contrast, the Social Security Administration's internal inspector general has studied fraud at the agency and recently released an audit of improper payments that found a much more limited picture.\nIt found fraudulent payments amounted to about 0.84% of total benefits paid from 2015 to 2022, which nonetheless totaled nearly $72 billion in that span, given the large financial footprint of the agency.\nBisignano embraced the inspector general's findings during his recent hearing — subtly downplaying Musk and Trump's claims of bigger fraud — and repeatedly said that even the 1% level of fraud is much too high.\nBisignano, who has called himself \"fundamentally a DOGE person,\" also said during the hearing he was open to working with Musk's team but that he would be willing to reverse decisions made by them.\nMusk's time at PayPal also appears to have been a precursor to Musk's disdain for government inefficiency.\nIn his history, Soni recounts an episode where PayPal discovered a fraudster operating just miles from their headquarters.\n\"We got all the evidence necessary,\" Musk told the author, adding for emphasis: \"Crime in progress!\" But Musk also remembered that it took \"forever\" for authorities to act on what he recalled as an open-and-shut case.\n\"This wasn't just parallel frustration with fraud and government — these frustrations were fused,\" Soni noted this past week.\nSoni said that the experience led many of PayPal's leaders to \"develop a particular institutional skepticism now embedded in tech culture: a wariness of processes that value procedural consistency over rapid adaptation.\"\nThe alumni of the company — now often referred to as the \"PayPal Mafia\" — include multiple prominent figures in Trump's orbit, such as White House AI and crypto czar David Sacks and venture capitalist Peter Thiel, who was the CEO of PayPal until its sale to eBay (EBAY) in 2002.\nIndeed, this frustration with government — and suspicion of fraud — has become a driver for Musk throughout his career.\nAs Musk put it in a 2013 tweet, he says he got rich during this early stage of his career, which included PayPal, and he did it with \"zero govt anything.\"\nBen Werschkul is a Washington correspondent for Yahoo Finance.\nEvery Friday, Yahoo Finance's Madison Mills, Rick Newman, and Ben Werschkul bring you a unique look at how US policy and government affect your bottom line on Capitol Gains. Watch or listen to Capitol Gains on Apple Podcasts, Spotify, or wherever you find your favorite podcasts.\nClick here for political news related to business and money policies that will shape tomorrow's stock prices\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "title": "Microsoft, PayPal downgraded: Wall Street's top analyst calls",
        "link": "https://finance.yahoo.com/news/microsoft-paypal-downgraded-wall-streets-133554255.html",
        "org": "The Fly",
        "date": "2025-04-17T13:35:54.000Z",
        "body": "The most talked about and market moving research calls around Wall Street are now in one place. Here are today's research calls that investors need to know, as compiled by The Fly.Top 5 Upgrades: \nRedburn Atlantic upgraded MongoDB (MDB) to Neutral from Sell with a price target of $170, down from $180. The firm sees no further downside in the shares, with MongoDB's valuation multiple trading near all-time lows, and earnings expectations already reset.\nScotiabank upgraded Intuit (INTU) to Outperform from Sector Perform with a price target of $700, up from $600. While the IRS Direct File program shutting down looks increasingly likely, Intuit has been heads down on disrupting the $35B assisted tax market through local search, timely marketing, and AI-powered Full Service delivering a superior customer experience, which the firm sees translating to 8%-plus Consumer revenue growth in FY25, the firm tells investors.\nLoop Capital upgraded Warby Parker (WRBY) to Buy from Hold with an unchanged price target of $27. The 41% selloff in the shares year-to-date is \"well overdone\" and provides a \"long-awaited attractive entry point,\" the firm tells investors in a research note.\nKeyBanc upgraded Yeti (YETI) to Sector Weight from Underweight without a price target. The firm reduced estimates but upgraded the shares citing Yeti's improved relative valuation.\nRedburn Atlantic upgraded Nasdaq (NDAQ) to Buy from Neutral with a price target of $91, down from $93. The market \"tumult\" and concerns of a technology stock selloff have created an opportunity for investors to gain access to Nasdaq's longer-term structural growth opportunities at a more compelling valuation, the firm tells investors in a research note.\nTop 5 Downgrades:\nKeyBanc downgraded Microsoft (MSFT) to Sector Weight from Overweight without a price target. The firm's Microsoft-specific reseller survey results were \"soft\" with the company's strategic importance dropping 4 points quarter-over-quarter, while its conversations have been largely mixed with increased focus around artificial intelligence monetization and capex flexibility.\nSeaport Research downgraded PayPal (PYPL) to Sell from Neutral with a $49 price target. The firm thinks it is going to be a struggle for the company to meet the medium-term guidance it provided at its investor day - particularly, accelerating to 8%-10% growth in Checkout TPV - if discretionary spend starts to slow as the firm expects.\nKeyBanc downgraded Teradyne (TER) to Sector Weight from Overweight without a price target. The firm says that given the \"numerous swings\" in trade policy in recent weeks and the \"unpredictable potential impact\" on end market demand, it is shifting its focus toward semiconductor capital equipment names \"with more direct catalysts and better visibility.\"\nCiti downgraded Enphase Energy (ENPH) to Sell from Neutral with a $47 price target. While near-term Street estimates have aligned with Citi's outlook, Enphase has a lack of clear catalysts for meaningful growth this year or next, the firm tells investors in a research note.\nRedburn Atlantic downgraded Fiserv (FI) to Sell from Neutral with a price target of $150, down from $220. The firm has concerns that a cyclical slowdown will unveil structural challenges around the durability of the company's growth.\nTop 5 Initiations: \nFollowing a transfer in analyst coverage, Netflix (NFLX) was assumed at Piper Sandler with an Overweight rating and $1,100 price target. Netflix may be the best positioned name in consumer internet as it has a \"strong\" entertainment value proposition and \"defensible\" subscription model, which is insulating in a recession, the firm tells investors in a research note.\nFollowing a transfer in analyst coverage, Roku (ROKU) was assumed at Piper Sandler with a Neutral rating and $65 price target. The firm sees \"much to like\" with Roku, but says it \"may be roiled\" by the weakening ad market and tariffs are potential headwinds.\nFollowing a transfer in analyst coverage, Trade Desk (TTD) was assumed at Piper Sandler with a Neutral rating and $55 price target. The firm likes Trade Desk's business model and proximity to the connected TV space, but says its advertising spend data points to a \"mixed picture,\" and it worries the company's Q4 miss and reset may take 1-2 more quarters to recover.\nBTIG initiated coverage of Evolus (EOLS) with a Buy rating and $21 price target. The firm says the company's \"differentiated go-to-market strategy\" as a non-therapeutic, cash-pay company allows it to bypass third-party payer reimbursement dynamics, enabling greater pricing flexibility and the ability to reinvest into provider practices through co-branded marketing initiatives.\nB. Riley initiated coverage of Anika Therapeutics (ANIK) with a Buy rating and $21 price target. The firm says the osteoarthritis pain management business provides strong profitability and cash flow to fund the development of the company's regenerative solutions portfolio. "
    },
    {
        "title": "PayPal Announces Retirement of Rodney C. Adkins from Board of Directors",
        "link": "https://finance.yahoo.com/news/paypal-announces-retirement-rodney-c-201500641.html",
        "org": "PR Newswire",
        "date": "2025-04-07T20:15:00.000Z",
        "body": "SAN JOSE, Calif., April 7, 2025 /PRNewswire/ -- PayPal Holdings, Inc. (NASDAQ: PYPL) announced today that Rodney C. Adkins has informed the company of his decision to retire from its Board of Directors (Board) and not stand for re-election at the 2025 Annual Meeting of Stockholders in June.\nAdkins has been a director of PayPal since September 2017 and currently serves on the Audit, Risk and Compliance Committee and the Corporate Governance and Nominating Committee of the Board.\n\"For more than seven years, Rod has played an instrumental role on our Board of Directors and has helped guide the growth and transformation of PayPal,\" said Enrique Lores, Chair of PayPal's Board of Directors. \"We will greatly miss Rod's impactful contributions. His sharp business acumen, strategic vision, and genuine authenticity have played a crucial role in shaping PayPal into the company it is today.\"\n\"On behalf of our PayPal team, I want to extend my heartfelt thanks to Rod for his exceptional leadership, his unwavering care, and his passionate support of our company,\" said Alex Chriss, President and CEO, PayPal. \"It has been a privilege to have worked alongside Rod, and I wish him well going forward.\"\nAbout PayPal PayPal has been revolutionizing commerce globally for more than 25 years. Creating innovative experiences that make moving money, selling, and shopping simple, personalized, and secure, PayPal empowers consumers and businesses in approximately 200 markets to join and thrive in the global economy. For more information, visit https://www.paypal.com, https://about.pypl.com, and https://investor.pypl.com.\nInvestor Relations Contact: investorrelations@paypal.com\nMedia Relations Contact: mediarelations@paypal.com\nView original content:https://www.prnewswire.com/news-releases/paypal-announces-retirement-of-rodney-c-adkins-from-board-of-directors-302422304.html\nSOURCE PayPal Holdings, Inc."
    }
]